
<!DOCTYPE HTML>
<html lang="" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>3-6. 프로젝트 실행하기 · GitBook</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.3">
        
        
        
    
    <link rel="stylesheet" href="../gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-search/search.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="../gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="../gitbook/images/favicon.ico" type="image/x-icon">

    
    <link rel="next" href="3-7.테스트_프로젝트_전환.html" />
    
    
    <link rel="prev" href="3-5.Neural_Network_모듈.html" />
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="Type to search" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    

    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="../">
            
                <a href="../">
            
                    
                    Introduction
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2" >
            
                <span>
            
                    
                    1. 플랫폼 소개
            
                </span>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.2.1" data-path="../chapter1/1-1.딥파이_소개.html">
            
                <a href="../chapter1/1-1.딥파이_소개.html">
            
                    
                    1-1. DEEP:PHI 소개
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2.2" data-path="../chapter1/1-2.주요기능.html">
            
                <a href="../chapter1/1-2.주요기능.html">
            
                    
                    1-2. 주요기능
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2.3" data-path="../chapter1/1-3.권장사양.html">
            
                <a href="../chapter1/1-3.권장사양.html">
            
                    
                    1-3. 권장사양
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    
        <li class="chapter " data-level="1.3" >
            
                <span>
            
                    
                    2. 화면 구성
            
                </span>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.3.1" data-path="../chapter2/2-1.메인화면.html">
            
                <a href="../chapter2/2-1.메인화면.html">
            
                    
                    2-1. 메인화면
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.2" data-path="../chapter2/2-2.프로젝트_대시보드.html">
            
                <a href="../chapter2/2-2.프로젝트_대시보드.html">
            
                    
                    2-2. 프로젝트 대시보드
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    
        <li class="chapter " data-level="1.4" >
            
                <span>
            
                    
                    3. 사용 방법
            
                </span>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.4.1" data-path="3-1.프로젝트_시작하기.html">
            
                <a href="3-1.프로젝트_시작하기.html">
            
                    
                    3-1. 프로젝트 시작하기
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4.2" data-path="3-2.Dataset_모듈.html">
            
                <a href="3-2.Dataset_모듈.html">
            
                    
                    3-2. Dataset 모듈
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4.3" data-path="3-3.Image_Processing_모듈.html">
            
                <a href="3-3.Image_Processing_모듈.html">
            
                    
                    3-3. Image Processing 모듈
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4.4" data-path="3-4.Data_Manipulation_모듈.html">
            
                <a href="3-4.Data_Manipulation_모듈.html">
            
                    
                    3-4. Data Manipulation 모듈
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4.5" data-path="3-5.Neural_Network_모듈.html">
            
                <a href="3-5.Neural_Network_모듈.html">
            
                    
                    3-5. Neural Network 모듈ㄷ
            
                </a>
            

            
        </li>
    
        <li class="chapter active" data-level="1.4.6" data-path="3-6.프로젝트_실행하기.html">
            
                <a href="3-6.프로젝트_실행하기.html">
            
                    
                    3-6. 프로젝트 실행하기
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4.7" data-path="3-7.테스트_프로젝트_전환.html">
            
                <a href="3-7.테스트_프로젝트_전환.html">
            
                    
                    3-7. 테스트 프로젝트 전환
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4.8" data-path="3-8.부가_기능.html">
            
                <a href="3-8.부가_기능.html">
            
                    
                    3-8. 부가 기능
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    
        <li class="chapter " data-level="1.5" >
            
                <span>
            
                    
                    4. 부록
            
                </span>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.5.1" data-path="../chapter4/4-1.데이터셋_템플릿.html">
            
                <a href="../chapter4/4-1.데이터셋_템플릿.html">
            
                    
                    4-1. 데이터셋 템플릿
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.5.2" data-path="../chapter4/4-2.DEEPPHI_플랫폼_모듈의_입출력_데이터_구조.html">
            
                <a href="../chapter4/4-2.DEEPPHI_플랫폼_모듈의_입출력_데이터_구조.html">
            
                    
                    4-2. DEEP:PHI 플랫폼 모듈의 입/출력 데이터 구조
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.5.3" data-path="../chapter4/4-3.Dicom_파일_비식별화_항목_안내.html">
            
                <a href="../chapter4/4-3.Dicom_파일_비식별화_항목_안내.html">
            
                    
                    4-3. Dicom 파일 비식별화 항목 안내
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.5.4" data-path="../chapter4/4-4.머신러닝_및_딥러닝_용어_정리.html">
            
                <a href="../chapter4/4-4.머신러닝_및_딥러닝_용어_정리.html">
            
                    
                    4-4. 머신러닝 및 딥러닝 용어 정리
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            Published with GitBook
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href=".." >3-6. 프로젝트 실행하기</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <h1 id="3-&#xC0AC;&#xC6A9;-&#xBC29;&#xBC95;">3. &#xC0AC;&#xC6A9; &#xBC29;&#xBC95;</h1>
<hr>
<h2 id="3-6-&#xD504;&#xB85C;&#xC81D;&#xD2B8;-&#xC2E4;&#xD589;&#xD558;&#xAE30;">3-6. &#xD504;&#xB85C;&#xC81D;&#xD2B8; &#xC2E4;&#xD589;&#xD558;&#xAE30;</h2>
<h3 id="1-&#xD504;&#xB85C;&#xC81D;&#xD2B8;-&#xC2E4;&#xD589;&#xD558;&#xAE30;">(1) &#xD504;&#xB85C;&#xC81D;&#xD2B8; &#xC2E4;&#xD589;&#xD558;&#xAE30;</h3>
<p>&#xD504;&#xB85C;&#xC81D;&#xD2B8; &#xD30C;&#xC774;&#xD504;&#xB77C;&#xC778;&#xC744; &#xC644;&#xC131;&#xD588;&#xB2E4;&#xBA74; &#xD504;&#xB85C;&#xC81D;&#xD2B8;&#xB97C; &#xC2E4;&#xD589;&#xC2DC;&#xCF1C; &#xD559;&#xC2B5;&#xC744; &#xC218;&#xD589;&#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.<br>&#xD504;&#xB85C;&#xC81D;&#xD2B8;&#xB97C; &#xC2E4;&#xD589;&#xD558;&#xB294; &#xBC29;&#xBC95;&#xC740; &#xB450; &#xAC00;&#xC9C0;&#xAC00; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. &#xC804;&#xCCB4; &#xD30C;&#xC774;&#xD504;&#xB77C;&#xC778;&#xC744; &#xD55C; &#xBC88;&#xC5D0; &#xC2E4;&#xD589;&#xC2DC;&#xD0A4;&#xAC70;&#xB098;, &#xAC1C;&#xBCC4; &#xBAA8;&#xB4C8; &#xB2E8;&#xC704;&#xB85C; &#xC2E4;&#xD589;&#xC2DC;&#xD0AC; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<p><br></p>
<h4 id="1-&#xC804;&#xCCB4;-&#xC2E4;&#xD589;">1) &#xC804;&#xCCB4; &#xC2E4;&#xD589;</h4>
<p><img src="img/3-6/manual_3-6_1_1_1.png" alt=""></p>
<p>&#xC0C1;&#xB2E8; &#xC6B0;&#xCE21;&#xC758; <code>RUN</code> &#xBC84;&#xD2BC;&#xC744; &#xB20C;&#xB7EC; &#xC804;&#xCCB4; &#xD30C;&#xC774;&#xD504;&#xB77C;&#xC778;&#xC744; &#xD55C; &#xBC88;&#xC5D0; &#xC2E4;&#xD589;&#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.<br><code>RUN</code> &#xBC84;&#xD2BC;&#xC758; &#xC6B0;&#xCE21; &#xC810;&#xC120; &#xBC84;&#xD2BC;&#xC744; &#xB20C;&#xB7EC; &#xC138;&#xBD80;&#xC801;&#xC778; &#xC2E4;&#xD589; &#xC635;&#xC158;&#xC744; &#xC120;&#xD0DD;&#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. &#xD574;&#xB2F9; &#xBC84;&#xD2BC;&#xC744; &#xD074;&#xB9AD;&#xD558;&#xBA74; &#xC544;&#xB798;&#xC640; &#xAC19;&#xC774; 2&#xAC00;&#xC9C0;&#xC758; &#xC2E4;&#xD589; &#xC544;&#xC774;&#xCF58;&#xC774; &#xD31D;&#xC5C5;&#xB429;&#xB2C8;&#xB2E4;.</p>
<p><img src="img/3-6/manual_3-6_1_1_2.png" alt=""></p>
<ul>
<li><code>RUN(All modules)</code> &#xBC84;&#xD2BC;&#xC740; &#xAE30;&#xC874;&#xC758; RUN &#xBC84;&#xD2BC;&#xACFC; &#xB3D9;&#xC77C;&#xD558;&#xAC8C; &#xC804;&#xCCB4; &#xBAA8;&#xB4C8;&#xC744; &#xC2E4;&#xD589;&#xD569;&#xB2C8;&#xB2E4;. &#xD30C;&#xC774;&#xD504;&#xB77C;&#xC778;&#xC758; &#xAC00;&#xC7A5; &#xC88C;&#xCE21; &#xBAA8;&#xB4C8;&#xBD80;&#xD130; &#xC21C;&#xCC28;&#xC801;&#xC73C;&#xB85C; &#xC5F0;&#xACB0;&#xB41C; &#xBAA8;&#xB4C8;&#xB4E4;&#xC744; &#xC2E4;&#xD589;&#xD569;&#xB2C8;&#xB2E4;.</li>
<li><code>Sample RUN</code> &#xBC84;&#xD2BC;&#xC740; &#xC804;&#xCCB4; &#xB370;&#xC774;&#xD130;&#xC14B;&#xC744; &#xD65C;&#xC6A9;&#xD574;&#xC11C; &#xC2E4;&#xD589;&#xD558;&#xB294; &#xAC83;&#xC774; &#xC544;&#xB2CC; &#xB370;&#xC774;&#xD130;&#xC14B;&#xC758; &#xC77C;&#xBD80; &#xB9CC;&#xC744; &#xC0AC;&#xC6A9;&#xD574;&#xC11C; &#xD504;&#xB85C;&#xC81D;&#xD2B8; &#xD30C;&#xC774;&#xD504;&#xB77C;&#xC778;&#xC744; &#xC2E4;&#xD589;&#xD569;&#xB2C8;&#xB2E4;. &#xB370;&#xC774;&#xD130;&#xC14B;&#xC774; &#xB9E4;&#xC6B0; &#xCEE4;&#xC11C; &#xAC01; &#xBAA8;&#xB4C8;&#xC758; &#xCC98;&#xB9AC; &#xC2DC;&#xAC04;&#xC774; &#xAE34; &#xACBD;&#xC6B0;, &#xD30C;&#xC774;&#xD504;&#xB77C;&#xC778;&#xC744; &#xC218;&#xC815;&#xD588;&#xC744; &#xB54C; &#xCC98;&#xC74C;&#xBD80;&#xD130; &#xB2E4;&#xC2DC; &#xC624;&#xB79C; &#xC2DC;&#xAC04;&#xC5D0; &#xAC78;&#xCCD0; &#xC2E4;&#xD589;&#xD574;&#xC57C; &#xD569;&#xB2C8;&#xB2E4;. &#xC774; &#xACBD;&#xC6B0; Sample RUN&#xC744; &#xC0AC;&#xC6A9;&#xD558;&#xBA74; &#xC77C;&#xBD80; &#xB370;&#xC774;&#xD130;&#xB9CC;&#xB97C; &#xC774;&#xC6A9;&#xD574; &#xB370;&#xC774;&#xD130;&#xC758; &#xBCC0;&#xD654; &#xC591;&#xC0C1;&#xC744; &#xC0B4;&#xD3B4;&#xBCFC; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. Sample RUN&#xC744; &#xC774;&#xC6A9;&#xD574; &#xC218;&#xC815; &#xACFC;&#xC815;&#xC744; &#xAC70;&#xCE5C; &#xB4A4; &#xC804;&#xCCB4; &#xB370;&#xC774;&#xD130;&#xC14B;&#xC73C;&#xB85C; &#xC644;&#xC131;&#xB41C; &#xD504;&#xB85C;&#xC81D;&#xD2B8;&#xB97C; &#xC2E4;&#xD589;&#xD558;&#xBA74; &#xD6A8;&#xC728;&#xC801;&#xC73C;&#xB85C; &#xD504;&#xB85C;&#xC81D;&#xD2B8;&#xB97C; &#xC9C4;&#xD589;&#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</li>
</ul>
<p><br></p>
<h4 id="2-&#xBAA8;&#xB4C8;-&#xBCC4;-&#xC2E4;&#xD589;">2) &#xBAA8;&#xB4C8; &#xBCC4; &#xC2E4;&#xD589;</h4>
<p><img src="img/3-6/manual_3-6_1_2.png" alt=""></p>
<p>&#xBAA8;&#xB4C8; &#xBCC4; &#xC2E4;&#xD589;&#xC740; &#xB450; &#xAC00;&#xC9C0; &#xBC29;&#xBC95;&#xC774; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.  </p>
<ul>
<li><span style="color:red">Run</span> &#xBC84;&#xD2BC;&#xC744; &#xD074;&#xB9AD;&#xD558;&#xBA74; &#xD574;&#xB2F9; &#xBAA8;&#xB4C8; &#xD558;&#xB098;&#xB9CC; &#xC2E4;&#xD589;&#xB429;&#xB2C8;&#xB2E4;.  </li>
<li><span style="color:blue">Step forward</span> &#xBC84;&#xD2BC;&#xC744; &#xD074;&#xB9AD;&#xD558;&#xBA74; &#xD574;&#xB2F9; &#xBAA8;&#xB4C8;&#xACFC; &#xADF8; &#xC774;&#xD6C4;&#xB85C; &#xC5F0;&#xACB0;&#xB418;&#xC5B4; &#xC788;&#xB294; &#xBAA8;&#xB4E0; &#xBAA8;&#xB4C8;&#xB4E4;&#xC774; &#xC21C;&#xCC28;&#xC801;&#xC73C;&#xB85C; &#xC2E4;&#xD589;&#xB429;&#xB2C8;&#xB2E4;.</li>
</ul>
<p><br><br></p>
<h3 id="2-&#xACB0;&#xACFC;-&#xD655;&#xC778;&#xD558;&#xAE30;">(2) &#xACB0;&#xACFC; &#xD655;&#xC778;&#xD558;&#xAE30;</h3>
<!-- 하단의 Output 탭, Files 탭과 우측 View 탭을 이용해 결과를 확인하는 방법 -->
<p align="center"><img src="img/3-6/manual_3-6_2_1.png" alt="&#xC544;&#xC774;&#xCF58; &#xCD08;&#xB85D;&#xC0C9;&#xC73C;&#xB85C; &#xBCC0;&#xACBD;" width="40%"></p>

<p>&#xC2E4;&#xD589;&#xC774; &#xC644;&#xB8CC;&#xB41C; &#xBAA8;&#xB4C8;&#xC740; &#xCD08;&#xB85D;&#xC0C9;&#xC73C;&#xB85C; &#xBCC0;&#xD558;&#xACE0; &#xC644;&#xB8CC; &#xC544;&#xC774;&#xCF58;&#xC774; &#xD45C;&#xC2DC;&#xB429;&#xB2C8;&#xB2E4;.<br>&#xBAA8;&#xB4C8; &#xC544;&#xB798;&#xC5D0;&#xB294; &#xCD9C;&#xB825; &#xB370;&#xC774;&#xD130;&#xC758; Shape&#xAC00; &#xD45C;&#xC2DC;&#xB429;&#xB2C8;&#xB2E4;. (None&#xC740; &#xD574;&#xB2F9; axis&#xC758; &#xD06C;&#xAE30;&#xAC00; &#xD1B5;&#xC77C;&#xB418;&#xC9C0; &#xC54A;&#xC558;&#xC74C;&#xC744; &#xC758;&#xBBF8;&#xD569;&#xB2C8;&#xB2E4;.)</p>
<p><br></p>
<p><img src="img/3-6/manual_3-6_2_2.png" alt="Files Tab (Original-Resize-Color to Grayscale)"></p>
<p>&#xD558;&#xB2E8;&#xC758; Files Tab&#xC5D0;&#xC11C; &#xAC01; &#xB370;&#xC774;&#xD130;&#xC758; &#xC0C1;&#xD0DC;&#xB97C; &#xD655;&#xC778;&#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<p>&#xC608;&#xC2DC;&#xB85C;, [256 x 256] <span style="color:green">Resize</span> &#xBAA8;&#xB4C8;&#xC744; &#xD1B5;&#xACFC;&#xD55C; &#xD6C4; &#xBAA8;&#xB4E0; &#xB370;&#xC774;&#xD130;&#xC758; &#xD06C;&#xAE30;&#xAC00; <span style="color:red">[256 x 256]</span>&#xC73C;&#xB85C; &#xD1B5;&#xC77C;&#xB418;&#xC5C8;&#xC74C;&#xC744; &#xD655;&#xC778;&#xD560; &#xC218; &#xC788;&#xACE0;,<br><span style="color:green">Color to Grayscale</span> &#xBAA8;&#xB4C8;&#xC744; &#xD1B5;&#xACFC;&#xD55C; &#xD6C4; &#xB370;&#xC774;&#xD130;&#xC758; Color Mode&#xAC00; <span style="color:red">RGB</span>&#xC5D0;&#xC11C; <span style="color:red">Grayscale</span>&#xB85C; &#xBCC0;&#xACBD;&#xB418;&#xC5C8;&#xC74C;&#xC744; &#xD655;&#xC778;&#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<p><br></p>
<p><img src="img/3-6/manual_3-6_2_3.png" alt="Output &#xC608;&#xC2DC;"></p>
<p>Neural Network &#xBAA8;&#xB4C8;&#xC744; &#xC2E4;&#xD589;&#xD558;&#xBA74; &#xD558;&#xB2E8;&#xC5D0; Output &#xD0ED;&#xC774; &#xCD94;&#xAC00;&#xB429;&#xB2C8;&#xB2E4;.<br>Output &#xD0ED;&#xC5D0;&#xC11C; &#xD559;&#xC2B5; &#xACB0;&#xACFC;&#xB97C; &#xC2E4;&#xC2DC;&#xAC04;&#xC73C;&#xB85C; &#xD655;&#xC778;&#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.<br>Output &#xD0ED;&#xC5D0;&#xC11C;&#xB294; Epoch &#xBCC4;&#xB85C; &#xB2E4;&#xC591;&#xD55C; &#xC131;&#xB2A5; &#xC218;&#xCE58;&#xB97C; &#xC218;&#xCE58;&#xC640; &#xADF8;&#xB798;&#xD504;&#xB85C; &#xD655;&#xC778;&#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. &#xADF8;&#xB798;&#xD504;&#xC5D0; &#xB9C8;&#xC6B0;&#xC2A4;&#xB97C; &#xAC00;&#xC838;&#xAC00;&#xBA74; &#xAC01; &#xC2DC;&#xC810;&#xC5D0;&#xC11C;&#xC758; &#xC815;&#xD655;&#xD55C; &#xC218;&#xCE58;&#xB97C; &#xD655;&#xC778;&#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.  </p>
<p>&#xAC01; &#xC131;&#xB2A5; &#xC218;&#xCE58;&#xC5D0; &#xB300;&#xD55C; &#xC790;&#xC138;&#xD55C; &#xC124;&#xBA85;&#xC740; &#xC544;&#xB798;&#xC758; <span style="color:blue">(3) &#xC131;&#xB2A5; &#xD3C9;&#xAC00;</span>&#xB97C; &#xCC38;&#xACE0; &#xBC14;&#xB78D;&#xB2C8;&#xB2E4;.</p>
<p><br></p>
<p align="center"><img src="img/3-6/manual_3-6_2_4.png" alt="View Tab" width="40%"></p>

<p>&#xC6B0;&#xCE21;&#xC758; View Tab&#xC5D0;&#xC11C; &#xBAA8;&#xB4C8;&#xC758; &#xCD9C;&#xB825; &#xC601;&#xC0C1;&#xC744; &#xD655;&#xC778;&#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.<br>&#xD2B9;&#xD788;, Neural Network &#xBAA8;&#xB4C8;&#xC758; &#xACBD;&#xC6B0;&#xB294; &#xC2E0;&#xACBD;&#xB9DD;&#xC774; &#xC601;&#xC0C1;&#xC758; &#xC5B4;&#xB290; &#xBD80;&#xBD84;&#xC744; &#xBCF4;&#xACE0; &#xD310;&#xB2E8;&#xD588;&#xB294;&#xC9C0;&#xB97C; &#xC54C;&#xB824;&#xC8FC;&#xB294; <span style="color:red">Grad-CAM Image</span>&#xAC00; &#xCD94;&#xAC00;&#xB85C; &#xC81C;&#xACF5;&#xB429;&#xB2C8;&#xB2E4;.<br>(* Grad-CAM Image&#xB294; 100% &#xC815;&#xD655;&#xD55C; &#xAC83;&#xC740; &#xC544;&#xB2C8;&#xBBC0;&#xB85C; &#xCC38;&#xACE0;&#xC0AC;&#xD56D;&#xC73C;&#xB85C;&#xB9CC; &#xC774;&#xC6A9;&#xD558;&#xC2DC;&#xAE30; &#xBC14;&#xB78D;&#xB2C8;&#xB2E4;.)</p>
<p><br><br></p>
<h3 id="3-&#xC131;&#xB2A5;-&#xD3C9;&#xAC00;">(3) &#xC131;&#xB2A5; &#xD3C9;&#xAC00;</h3>
<!-- 각 Measurement에 대한 설명 -->
<p>&#xC131;&#xB2A5; &#xD3C9;&#xAC00;&#xB294; &#xC778;&#xACF5;&#xC9C0;&#xB2A5; &#xD559;&#xC2B5; &#xACFC;&#xC815;&#xC5D0;&#xC11C; &#xB9E4;&#xC6B0; &#xC911;&#xC694;&#xD55C; &#xBD80;&#xBD84;&#xC785;&#xB2C8;&#xB2E4;.  </p>
<p>&#xAC01;&#xC885; &#xC131;&#xB2A5;&#xC9C0;&#xD45C;&#xB294; &#xD559;&#xC2B5;&#xC774; &#xC815;&#xC0C1;&#xC801;&#xC73C;&#xB85C; &#xC218;&#xD589;&#xB418;&#xACE0; &#xC788;&#xB294;&#xAC00;, &#xADF8;&#xB807;&#xC9C0; &#xC54A;&#xB2E4;&#xBA74; &#xC5B4;&#xB5A0;&#xD55C; &#xBC29;&#xD5A5;&#xC73C;&#xB85C; &#xD559;&#xC2B5;&#xC774; &#xB418;&#xACE0; &#xC788;&#xB294;&#xAC00;&#xB97C; &#xD310;&#xB2E8;&#xD560; &#xC218; &#xC788;&#xAC8C; &#xD574; &#xC90D;&#xB2C8;&#xB2E4;. &#xC774;&#xB97C; &#xD1B5;&#xD574; &#xC5F0;&#xAD6C;&#xC790;&#xB294; &#xC804;&#xCCB4;&#xC801;&#xC778; &#xD30C;&#xC774;&#xD504;&#xB77C;&#xC778;&#xC758; &#xC218;&#xC815; &#xBC29;&#xD5A5;&#xC744; &#xC54C; &#xC218; &#xC788;&#xACE0; &#xB098;&#xC544;&#xAC00; &#xC5F0;&#xAD6C; &#xBAA9;&#xD45C;&#xC5D0; &#xB3C4;&#xB2EC;&#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. &#xB530;&#xB77C;&#xC11C; &#xC778;&#xACF5;&#xC9C0;&#xB2A5;&#xC758; &#xD559;&#xC2B5; &#xACFC;&#xC815;&#xACFC; &#xD559;&#xC2B5; &#xC885;&#xB8CC; &#xD6C4; &#xC131;&#xB2A5;&#xC744; &#xD3C9;&#xAC00;&#xD574;&#xC11C; &#xC0AC;&#xC6A9;&#xC790;&#xC758; &#xAE30;&#xC900;&#xC5D0; &#xB9DE;&#xB294; &#xC131;&#xB2A5;&#xC5D0; &#xB3C4;&#xB2EC;&#xD588;&#xB294;&#xC9C0; &#xD655;&#xC778;&#xD558;&#xB294; &#xACFC;&#xC815;&#xC744; &#xAC70;&#xCCD0;&#xC57C; &#xD569;&#xB2C8;&#xB2E4;.</p>
<p>&#xC9C0;&#xB3C4;&#xD559;&#xC2B5;(Supervised Learning)&#xC758; &#xC131;&#xB2A5; &#xD3C9;&#xAC00; &#xACFC;&#xC815;&#xC740; &#xC2E0;&#xACBD;&#xB9DD; &#xC54C;&#xACE0;&#xB9AC;&#xC998;&#xC758; &#xC608;&#xCE21; &#xACB0;&#xACFC;&#xC640; &#xC2E4;&#xC81C; &#xD604;&#xC2E4;&#xC758; &#xC815;&#xB2F5;(Ground Truth)&#xC778; Label &#xB370;&#xC774;&#xD130;&#xB97C; &#xBE44;&#xAD50;&#xD574;&#xAC00;&#xBA70; &#xC62C;&#xBC14;&#xB974;&#xAC8C; &#xC608;&#xCE21;&#xD558;&#xC600;&#xB294;&#xC9C0; &#xBE44;&#xAD50;&#xD558;&#xB294; &#xACFC;&#xC815;&#xC744; &#xAC70;&#xCE58;&#xACE0; &#xC774;&#xB97C; &#xC0AC;&#xC6A9;&#xC790;&#xAC00; &#xC774;&#xD574;&#xD560; &#xC218; &#xC788;&#xB294; &#xC218;&#xCE58;&#xB85C; &#xD45C;&#xD604;&#xD558;&#xAC8C; &#xB429;&#xB2C8;&#xB2E4;.</p>
<p>DEEP:PHI &#xD50C;&#xB7AB;&#xD3FC;&#xC5D0;&#xC11C;&#xB294; &#xC190;&#xC2E4;(Loss), &#xC815;&#xD655;&#xB3C4;(Accuracy), &#xBBFC;&#xAC10;&#xB3C4;(Sensitivity), &#xD2B9;&#xC774;&#xB3C4;(Specificity) &#xB4F1;&#xC758; &#xB2E4;&#xC591;&#xD55C; &#xC218;&#xCE58;&#xB97C; &#xD45C;&#xC640; &#xADF8;&#xB798;&#xD504; &#xD615;&#xD0DC;&#xB85C; &#xC81C;&#xACF5;&#xD569;&#xB2C8;&#xB2E4;.</p>
<p><br></p>
<h4 id="&#xAC01;-task-&#xBCC4;-&#xC81C;&#xACF5;&#xB418;&#xB294;-&#xC131;&#xB2A5;-&#xC218;&#xCE58;">&#xAC01; Task &#xBCC4; &#xC81C;&#xACF5;&#xB418;&#xB294; &#xC131;&#xB2A5; &#xC218;&#xCE58;</h4>
<p>&#xC2E0;&#xACBD;&#xB9DD;&#xC774; &#xC218;&#xD589;&#xD558;&#xB294; Task&#xC5D0; &#xB530;&#xB77C; &#xC81C;&#xACF5;&#xB418;&#xB294; &#xC131;&#xB2A5; &#xC218;&#xCE58;&#xAC00; &#xB2E4;&#xB985;&#xB2C8;&#xB2E4;. </p>
<p><strong>1) Classification:</strong></p>
<ul>
<li>Loss</li>
<li>Accuracy</li>
<li>Accuracy by class</li>
<li>Sensitivity</li>
<li>Specificity</li>
<li>PPV</li>
<li>NPV</li>
<li>Dice</li>
</ul>
<p><br></p>
<p><strong>2) Segmentation:</strong></p>
<ul>
<li>Loss</li>
<li>Accuracy</li>
<li>Accuracy by class</li>
<li>Sensitivity</li>
<li>Specificity</li>
<li>PPV</li>
<li>NPV</li>
<li>Dice</li>
<li>mIOU</li>
</ul>
<p><br></p>
<p><strong>3) Detection:</strong></p>
<ul>
<li>Loss</li>
<li>mAP</li>
<li>Accuracy by class</li>
</ul>
<p><br></p>
<p><strong>4) Transformation:</strong></p>
<ul>
<li>Loss</li>
<li>MAE</li>
<li>MSE</li>
<li>RMSE</li>
<li>MSLE</li>
<li>PSNR</li>
</ul>
<p><br></p>
<h4 id="&#xC131;&#xB2A5;-&#xC218;&#xCE58;-&#xC0C1;&#xC138;&#xC124;&#xBA85;">&#xC131;&#xB2A5; &#xC218;&#xCE58; &#xC0C1;&#xC138;&#xC124;&#xBA85;</h4>
<p>&#xC131;&#xB2A5; &#xC218;&#xCE58;&#xB294; &#xAC01; &#xD074;&#xB798;&#xC2A4; &#xBCC4;&#xB85C; &#xC815;&#xD0D0;&#xACFC; &#xC624;&#xD0D0;&#xC744; &#xCCB4;&#xD06C;&#xD558;&#xC5EC; &#xC5F0;&#xC0B0;&#xD558;&#xB294; &#xAC83;&#xC5D0;&#xC11C; &#xC2DC;&#xC791;&#xD569;&#xB2C8;&#xB2E4;.<br>&#xC544;&#xB798; &#xD45C;&#xC5D0;&#xC11C; &#xD655;&#xC778;&#xD558;&#xB294; &#xAC83;&#xCC98;&#xB7FC; &#xC2E4;&#xC81C; True&#xB97C; True&#xB77C;&#xACE0; &#xB9DE;&#xCD98; &#xACBD;&#xC6B0;&#xB97C; <strong>True Positive(TP)</strong>, &#xC2E4;&#xC81C; True&#xB97C; False&#xB77C;&#xACE0; &#xC798;&#xBABB; &#xB9DE;&#xCD98; &#xACBD;&#xC6B0;&#xB97C; <strong>False Negative(FN)</strong>, &#xC2E4;&#xC81C; False&#xB97C; False&#xB77C;&#xACE0; &#xB9DE;&#xCD98; &#xACBD;&#xC6B0;&#xB97C; <strong>True Negative(TN)</strong>, &#xC2E4;&#xC81C; False&#xB97C; True&#xB77C;&#xACE0; &#xC798;&#xBABB; &#xB9DE;&#xCD98; &#xACBD;&#xC6B0;&#xB97C; <strong>False Positive(FN)</strong>&#xB77C;&#xACE0; &#xD569;&#xB2C8;&#xB2E4;.</p>
<p><br></p>
<p align="center"><img src="img/3-6/manual_3-6_3.png" alt="" width="60%"></p>

<p><br></p>
<p><strong>[&#xB192;&#xC744;&#xC218;&#xB85D; &#xC88B;&#xC740; &#xC131;&#xB2A5; &#xC218;&#xCE58;]</strong></p>
<ul>
<li><p><strong>Accuracy</strong> (&#xC815;&#xD655;&#xB3C4;) : &#xC815;&#xB2F5;&#xC744; &#xB9DE;&#xCD98; &#xBE44;&#xC728;&#xC785;&#xB2C8;&#xB2E4;.  </p>
<p align="center"><img src="img/3-6/modify_accuracy.png" alt="" width="400px"></p>
</li>
<li><p><strong>Accuracy by Class</strong> : &#xAC01; Class &#xBCC4; Accuracy&#xB97C; &#xACC4;&#xC0B0;&#xD569;&#xB2C8;&#xB2E4;.</p>
</li>
<li><p><strong>Sensitivity</strong> (&#xBBFC;&#xAC10;&#xB3C4;) : &#xC2E4;&#xC81C; True&#xC778; &#xC0AC;&#xB78C;&#xC744; True&#xB77C;&#xACE0; &#xC608;&#xCE21;&#xD558;&#xB294; &#xBE44;&#xC728;&#xC785;&#xB2C8;&#xB2E4;.  </p>
<p align="center"><img src="img/3-6/modify_sensitivity.png" alt="" width="400px"></p>
</li>
<li><p><strong>Specificity</strong> (&#xD2B9;&#xC774;&#xB3C4;) : &#xC2E4;&#xC81C; False&#xC778; &#xC0AC;&#xB78C;&#xC744; False&#xB77C;&#xACE0; &#xC608;&#xCE21;&#xD558;&#xB294; &#xBE44;&#xC728;&#xC785;&#xB2C8;&#xB2E4;.  </p>
<p align="center"><img src="img/3-6/modify_specificity.png" alt="" width="400px"></p>
</li>
<li><p><strong>PPV</strong> (&#xC591;&#xC131;&#xC608;&#xCE21;&#xB3C4;) : True&#xB77C;&#xACE0; &#xC608;&#xCE21;&#xD55C; &#xAC83; &#xC911; &#xC2E4;&#xC81C; True&#xC778; &#xAC83;&#xC758; &#xBE44;&#xC728;&#xC785;&#xB2C8;&#xB2E4;.  </p>
<p align="center"><img src="img/3-6/modify_ppv.png" alt="" width="400px"></p>
</li>
<li><p><strong>NPV</strong> (&#xC74C;&#xC131;&#xC608;&#xCE21;&#xB3C4;) : False&#xB77C;&#xACE0; &#xC608;&#xCE21;&#xD55C; &#xAC83; &#xC911; &#xC2E4;&#xC81C; False&#xC778; &#xAC83;&#xC758; &#xBE44;&#xC728;&#xC785;&#xB2C8;&#xB2E4;.  </p>
<p align="center"><img src="img/3-6/modify_npv.png" alt="" width="400px"></p>
</li>
<li><p><strong>Dice coefficient</strong> : &#xB450; &#xC601;&#xC5ED;&#xC774; &#xC5BC;&#xB9C8;&#xB098; &#xACB9;&#xCE58;&#xB294;&#xC9C0;&#xC5D0; &#xB300;&#xD55C; &#xBE44;&#xC728;&#xC785;&#xB2C8;&#xB2E4;.  </p>
<p align="center"><img src="img/3-6/modify_dice_coefficient.png" alt="" width="400px"></p>
</li>
<li><p><strong>mIoU</strong> (mean Intersection over Union) : Dice coefficient&#xC640; &#xB9C8;&#xCC2C;&#xAC00;&#xC9C0;&#xB85C; &#xB450; &#xC601;&#xC5ED;&#xC774; &#xC5BC;&#xB9C8;&#xB098; &#xACB9;&#xCE58;&#xB294;&#xC9C0;&#xC5D0; &#xB300;&#xD55C; &#xBE44;&#xC728;&#xC785;&#xB2C8;&#xB2E4;. Dice coefficient&#xBCF4;&#xB2E4; &#xC624;&#xCC28;&#xB97C; &#xB354; &#xADF9;&#xB300;&#xD654;&#xD55C;&#xB2E4;&#xB294; &#xC810;&#xC5D0;&#xC11C; &#xCC28;&#xC774;&#xAC00; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<p align="center"><img src="img/3-6/modify_miou.png" alt="" width="400px"></p>
</li>
<li><p><strong>mAP</strong> (mean Average Precision) : &#xAC01; class &#xBCC4; AP(Average Precision)&#xC758; &#xD3C9;&#xADE0;&#xC744; &#xC758;&#xBBF8;&#xD569;&#xB2C8;&#xB2E4;. AP&#xB294; threshold&#xB97C; &#xC870;&#xC815;&#xD568;&#xC5D0; &#xB530;&#xB77C; &#xB2EC;&#xB77C;&#xC9C0;&#xB294; Precision(PPV) &#xAC12;&#xC758; &#xD3C9;&#xADE0;&#xAC12;&#xC785;&#xB2C8;&#xB2E4;.</p>
</li>
<li><p><strong>PSNR</strong> (Peak Signal-to-Noise Ratio, &#xC2E0;&#xD638; &#xB300; &#xC7A1;&#xC74C;&#xBE44;) : &#xC601;&#xC0C1;&#xC758; &#xCD5C;&#xB300;&#xAC12;&#xC5D0; &#xB300;&#xD55C; &#xC190;&#xC2E4;&#xC758; &#xBE44;&#xB97C; &#xB098;&#xD0C0;&#xB0C5;&#xB2C8;&#xB2E4;.  </p>
<p align="center"><img src="img/3-6/psnr.png" alt="" width="350px"></p>

</li>
</ul>
<p><br></p>
<p><strong>[&#xB0AE;&#xC744;&#xC218;&#xB85D; &#xC88B;&#xC740; &#xC131;&#xB2A5; &#xC218;&#xCE58;]</strong></p>
<ul>
<li><p><strong>Loss</strong> (&#xC190;&#xC2E4;) : &#xC190;&#xC2E4; &#xD568;&#xC218;&#xC5D0; &#xC758;&#xD574; &#xACC4;&#xC0B0;&#xB418;&#xB294; &#xAC12;&#xC785;&#xB2C8;&#xB2E4;.  </p>
</li>
<li><p><strong>MAE</strong> (Mean Absolute Error) : &#xC815;&#xB2F5; &#xAC12;&#xACFC;&#xC758; &#xCC28;(Error)&#xC758; &#xC808;&#xB313;&#xAC12;&#xC758; &#xD3C9;&#xADE0;&#xC785;&#xB2C8;&#xB2E4;.  </p>
<p align="center"><img src="img/3-6/mae.png" alt="" width="300px"></p>
</li>
<li><p><strong>MSE</strong> (Mean Squared Error) : &#xC815;&#xB2F5; &#xAC12;&#xACFC;&#xC758; &#xCC28;(Error)&#xC758; &#xC81C;&#xACF1;&#xC758; &#xD3C9;&#xADE0;&#xC785;&#xB2C8;&#xB2E4;.  </p>
<p align="center"><img src="img/3-6/mse.png" alt="" width="250px"></p>
</li>
<li><p><strong>RMSE</strong> (Root Mean Squared Error) : MSE&#xB97C; &#xBCF4;&#xC815;&#xD574; &#xC900; &#xAC12;&#xC785;&#xB2C8;&#xB2E4;.  </p>
<p align="center"><img src="img/3-6/rmse.png" alt="" width="250px"></p>
</li>
<li><p><strong>MSLE</strong> (Mean Squared Log Error) : MSE&#xB97C; &#xBCF4;&#xC815;&#xD574; &#xC900; &#xAC12;&#xC785;&#xB2C8;&#xB2E4;.  </p>
<p align="center"><img src="img/3-6/msle.png" alt="" width="400px"></p>

</li>
</ul>
<p><br></p>
<p>&#xC774;&#xB7EC;&#xD55C; &#xC131;&#xB2A5; &#xC218;&#xCE58;&#xB4E4;&#xC740; Neural Network &#xBAA8;&#xB4C8;&#xC758; Output &#xD0ED;&#xC5D0;&#xC11C; &#xD45C;&#xC640; &#xADF8;&#xB798;&#xD504;&#xC758; &#xD615;&#xD0DC;&#xB85C; &#xC27D;&#xAC8C; &#xD655;&#xC778;&#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.<br>&#xB610;&#xD55C; &#xC704; &#xC131;&#xB2A5; &#xC218;&#xCE58;&#xB4E4;&#xC740; &#xC54C;&#xACE0;&#xB9AC;&#xC998;&#xC758; &#xC608;&#xCE21; &#xC815;&#xD655;&#xB3C4;&#xC774;&#xAE30; &#xB54C;&#xBB38;&#xC5D0; &#xC608;&#xCE21;&#xD558;&#xB824;&#xB294; &#xAC01; &#xAC1C;&#xBCC4; &#xD074;&#xB798;&#xC2A4; &#xBCC4;&#xB85C; &#xC218;&#xCE58; &#xC5F0;&#xC0B0;&#xC744; &#xC218;&#xD589;&#xD569;&#xB2C8;&#xB2E4;.<br>DEEP:PHI&#xC5D0;&#xC120; &#xB9E4; &#xD559;&#xC2B5; &#xB2E8;&#xACC4;&#xB9C8;&#xB2E4;, &#xB9E4; &#xD074;&#xB798;&#xC2A4; &#xBCC4;&#xB85C; &#xD574;&#xB2F9; &#xC218;&#xCE58;&#xB97C; &#xC5F0;&#xC0B0;&#xD574;&#xC11C; &#xC0AC;&#xC6A9;&#xC790;&#xAC00; &#xD655;&#xC778;&#xD560; &#xC218; &#xC788;&#xB3C4;&#xB85D; &#xC81C;&#xACF5;&#xD558;&#xACE0; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p>

                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="3-5.Neural_Network_모듈.html" class="navigation navigation-prev " aria-label="Previous page: 3-5. Neural Network 모듈ㄷ">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
                <a href="3-7.테스트_프로젝트_전환.html" class="navigation navigation-next " aria-label="Next page: 3-7. 테스트 프로젝트 전환">
                    <i class="fa fa-angle-right"></i>
                </a>
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"3-6. 프로젝트 실행하기","level":"1.4.6","depth":2,"next":{"title":"3-7. 테스트 프로젝트 전환","level":"1.4.7","depth":2,"path":"chapter3/3-7.테스트_프로젝트_전환.md","ref":"chapter3/3-7.테스트_프로젝트_전환.md","articles":[]},"previous":{"title":"3-5. Neural Network 모듈ㄷ","level":"1.4.5","depth":2,"path":"chapter3/3-5.Neural_Network_모듈.md","ref":"chapter3/3-5.Neural_Network_모듈.md","articles":[]},"dir":"ltr"},"config":{"gitbook":"*","theme":"default","variables":{},"plugins":[],"pluginsConfig":{"highlight":{},"search":{},"lunr":{"maxIndexSize":1000000,"ignoreSpecialCharacters":false},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"fontsettings":{"theme":"white","family":"sans","size":2},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"}},"file":{"path":"chapter3/3-6.프로젝트_실행하기.md","mtime":"2021-02-22T07:39:35.872Z","type":"markdown"},"gitbook":{"version":"3.2.3","time":"2021-02-22T07:42:13.512Z"},"basePath":"..","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="../gitbook/gitbook.js"></script>
    <script src="../gitbook/theme.js"></script>
    
        
        <script src="../gitbook/gitbook-plugin-search/search-engine.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-search/search.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-lunr/lunr.min.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-lunr/search-lunr.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-sharing/buttons.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

