
<!DOCTYPE HTML>
<html lang="" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>3-6. 부가 기능 · GitBook</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.3">
        
        
        
    
    <link rel="stylesheet" href="../gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-search/search.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="../gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="../gitbook/images/favicon.ico" type="image/x-icon">

    
    
    <link rel="prev" href="성능_고도화.html" />
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="Type to search" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    

    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="../">
            
                <a href="../">
            
                    
                    릴리즈 노트
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2" >
            
                <span>
            
                    
                    1. 플랫폼 소개
            
                </span>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.2.1" data-path="../chapter1/딥파이_소개.html">
            
                <a href="../chapter1/딥파이_소개.html">
            
                    
                    1-1. DEEP:PHI 소개
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2.2" data-path="../chapter1/권장사양.html">
            
                <a href="../chapter1/권장사양.html">
            
                    
                    1-2. 권장사양
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2.3" data-path="../chapter1/주요기능.html">
            
                <a href="../chapter1/주요기능.html">
            
                    
                    1-3. 주요기능
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    
        <li class="chapter " data-level="1.3" >
            
                <span>
            
                    
                    2. 화면 구성
            
                </span>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.3.1" data-path="../chapter2/로그인.html">
            
                <a href="../chapter2/로그인.html">
            
                    
                    2-1. 로그인
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.2" data-path="../chapter2/프로젝트_대시보드.html">
            
                <a href="../chapter2/프로젝트_대시보드.html">
            
                    
                    2-2. 프로젝트 대시보드
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.3" data-path="../chapter2/프로젝트_모델러.html">
            
                <a href="../chapter2/프로젝트_모델러.html">
            
                    
                    2-3. 프로젝트 모델러
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    
        <li class="chapter " data-level="1.4" >
            
                <span>
            
                    
                    3. 사용 방법
            
                </span>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.4.1" data-path="프로젝트_구성.html">
            
                <a href="프로젝트_구성.html">
            
                    
                    3-1. 프로젝트 구성
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4.2" data-path="데이터셋_업로드_및_관리하기.html">
            
                <a href="데이터셋_업로드_및_관리하기.html">
            
                    
                    3-2. 데이터셋 업로드 및 관리하기
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4.3" data-path="파이프라인_생성.html">
            
                <a href="파이프라인_생성.html">
            
                    
                    3-3. 파이프라인 생성
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4.4" data-path="성능_평가.html">
            
                <a href="성능_평가.html">
            
                    
                    3-4. 성능 평가
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4.5" data-path="성능_고도화.html">
            
                <a href="성능_고도화.html">
            
                    
                    3-5. 성능 고도화
            
                </a>
            

            
        </li>
    
        <li class="chapter active" data-level="1.4.6" data-path="부가_기능.html">
            
                <a href="부가_기능.html">
            
                    
                    3-6. 부가 기능
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    
        <li class="chapter " data-level="1.5" >
            
                <span>
            
                    
                    4. 부록
            
                </span>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.5.1" data-path="../chapter4/데이터셋_템플릿.html">
            
                <a href="../chapter4/데이터셋_템플릿.html">
            
                    
                    4-1. 데이터셋 템플릿
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.5.2" data-path="../chapter4/DEEPPHI_플랫폼_모듈의_입출력_데이터_구조.html">
            
                <a href="../chapter4/DEEPPHI_플랫폼_모듈의_입출력_데이터_구조.html">
            
                    
                    4-2. DEEP:PHI 플랫폼 모듈의 입/출력 데이터 구조
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.5.3" data-path="../chapter4/Dicom_파일_비식별화_항목_안내.html">
            
                <a href="../chapter4/Dicom_파일_비식별화_항목_안내.html">
            
                    
                    4-3. Dicom 파일 비식별화 항목 안내
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.5.4" data-path="../chapter4/머신러닝_및_딥러닝_용어_정리.html">
            
                <a href="../chapter4/머신러닝_및_딥러닝_용어_정리.html">
            
                    
                    4-4. 머신러닝 및 딥러닝 용어 정리
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    
        <li class="chapter " data-level="1.6" >
            
                <span>
            
                    
                    5. History
            
                </span>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.6.1" data-path="../release/2020-04.1126016.html">
            
                <a href="../release/2020-04.1126016.html">
            
                    
                    Version 2020-04.1126016
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            Published with GitBook
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href=".." >3-6. 부가 기능</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <h1 id="3-&#xC0AC;&#xC6A9;-&#xBC29;&#xBC95;">3. &#xC0AC;&#xC6A9; &#xBC29;&#xBC95;</h1>
<hr>
<h2 id="3-6-&#xBD80;&#xAC00;-&#xAE30;&#xB2A5;">3-6. &#xBD80;&#xAC00; &#xAE30;&#xB2A5;</h2>
<p>DEEP:PHI &#xD50C;&#xB7AB;&#xD3FC;&#xC740; &#xC0AC;&#xC6A9;&#xC790; &#xD3B8;&#xC758;&#xC131; &#xC99D;&#xB300;&#xB97C; &#xC704;&#xD574; &#xB2E4;&#xC591;&#xD55C; &#xBD80;&#xAC00;&#xAE30;&#xB2A5;&#xC744; &#xC81C;&#xACF5;&#xD558;&#xACE0; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.<br>&#xC5F0;&#xAD6C; &#xD3B8;&#xC758;&#xC131; &#xC99D;&#xB300;&#xB97C; &#xC704;&#xD574; &#xB2E4;&#xC591;&#xD55C; &#xC0AC;&#xC6A9;&#xC790;&#xB4E4;&#xC744; &#xB0B4; &#xD504;&#xB85C;&#xC81D;&#xD2B8;&#xC5D0; &#xCD08;&#xB300;&#xD558;&#xACE0; &#xD2B9;&#xBCC4;&#xD558;&#xAC8C; &#xC81C;&#xC791;&#xD55C; Image Processing &#xBAA8;&#xB4C8;&#xACFC; Neural Network &#xBAA8;&#xB4C8;&#xC744; &#xB2E4;&#xB978; &#xC0AC;&#xC6A9;&#xC790;&#xB4E4;&#xC5D0;&#xAC8C; &#xACF5;&#xC720;&#xD558;&#xACE0;, &#xB0B4; &#xD504;&#xB85C;&#xC81D;&#xD2B8; &#xD30C;&#xC774;&#xD504;&#xB77C;&#xC778;&#xC744; &#xB2E4;&#xB978; &#xC0AC;&#xC6A9;&#xC790;&#xC5D0;&#xAC8C; &#xACF5;&#xC720;&#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.<br>&#xADF8;&#xB9AC;&#xACE0; &#xC5F0;&#xAD6C; &#xACB0;&#xACFC;&#xB97C; &#xB17C;&#xBB38;&#xACFC; &#xAC19;&#xC740; &#xC0B0;&#xCD9C;&#xBB3C;&#xB85C; &#xC81C;&#xC791;&#xD558;&#xAE30; &#xD3B8;&#xB9AC;&#xD558;&#xB3C4;&#xB85D; &#xC6D0;&#xBCF8; &#xB370;&#xC774;&#xD130;&#xC14B;&#xBD80;&#xD130; &#xAC01; &#xBAA8;&#xB4C8;&#xC758; &#xACB0;&#xACFC; &#xC774;&#xBBF8;&#xC9C0;, &#xADF8;&#xB9AC;&#xACE0; &#xD504;&#xB85C;&#xC81D;&#xD2B8; &#xD30C;&#xC774;&#xD504;&#xB77C;&#xC778;&#xC758; &#xC2A4;&#xD06C;&#xB9B0;&#xC0F7; &#xCEA1;&#xCCD0; &#xAE30;&#xB2A5;&#xC744; &#xD3EC;&#xD568;&#xD55C; &#xB2E4;&#xC591;&#xD55C; &#xC885;&#xB958;&#xC758; &#xB370;&#xC774;&#xD130; &#xB2E4;&#xC6B4;&#xB85C;&#xB4DC; &#xAE30;&#xB2A5;&#xC744; &#xC81C;&#xACF5;&#xD569;&#xB2C8;&#xB2E4;.</p>
<h3 id="1-&#xD504;&#xB85C;&#xC81D;&#xD2B8;-&#xACF5;&#xB3D9;&#xC5F0;&#xAD6C;">1) &#xD504;&#xB85C;&#xC81D;&#xD2B8; &#xACF5;&#xB3D9;&#xC5F0;&#xAD6C;</h3>
<p><img src="manual_3-6_1_1.png" alt=""></p>
<blockquote>
<p>&#xD504;&#xB85C;&#xC81D;&#xD2B8; &#xB0B4;&#xBD80;&#xC5D0;&#xC11C; &#xC88C;&#xCE21; &#xD0ED;&#xC758; Members&#xB97C; &#xD074;&#xB9AD;&#xD558;&#xBA74; &#xD604;&#xC7AC; &#xD504;&#xB85C;&#xC81D;&#xD2B8;&#xC758; &#xAD6C;&#xC131;&#xC6D0;&#xC744; &#xD655;&#xC778;&#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.<br>&#xAC01; &#xAD6C;&#xC131;&#xC6D0; &#xBCC4; &#xAD8C;&#xD55C;&#xC744; &#xAD00;&#xB9AC;&#xD558;&#xB824;&#xBA74; Setting&#xC744;, &#xAD6C;&#xC131;&#xC6D0;&#xC744; &#xCD94;&#xAC00;&#xD558;&#xB824;&#xBA74; Invite &#xBC84;&#xD2BC;&#xC744; &#xB20C;&#xB7EC; &#xAD6C;&#xC131;&#xC6D0;&#xC744; &#xCD94;&#xAC00;&#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
</blockquote>
<p><br></p>
<p><img src="manual_3-6_1_2.png" alt=""></p>
<blockquote>
<p>&#xD504;&#xB85C;&#xC81D;&#xD2B8; &#xAD6C;&#xC131;&#xC6D0;&#xC744; &#xCD94;&#xAC00;&#xD558;&#xB294; &#xACBD;&#xC6B0; &#xD574;&#xB2F9; &#xC0AC;&#xC6A9;&#xC790;&#xC758; DEEP:PHI &#xD50C;&#xB7AB;&#xD3FC; &#xACC4;&#xC815;(&#xC774;&#xBA54;&#xC77C; &#xC8FC;&#xC18C;), &#xD504;&#xB85C;&#xC81D;&#xD2B8; &#xB0B4;&#xC5D0;&#xC11C;&#xC758; &#xC5ED;&#xD560;&#xACFC; &#xCD08;&#xB300; &#xBA54;&#xC2DC;&#xC9C0;&#xB97C; &#xC785;&#xB825;&#xD558;&#xACE0; Invite&#xB97C; &#xB204;&#xB974;&#xBA74; &#xD574;&#xB2F9; &#xC0AC;&#xC6A9;&#xC790;&#xC5D0;&#xAC8C; &#xCD08;&#xB300;&#xC7A5;&#xC774; &#xBC1C;&#xC1A1;&#xB429;&#xB2C8;&#xB2E4;.</p>
</blockquote>
<p><br></p>
<p><img src="manual_3-6_1_3.png" alt=""></p>
<blockquote>
<p>&#xAE30;&#xC874; &#xAD6C;&#xC131;&#xC6D0;&#xC5D0; &#xB300;&#xD574; &#xAD8C;&#xD55C; &#xD3B8;&#xC9D1;&#xC744; &#xC218;&#xD589;&#xD558;&#xB824;&#xBA74; Setting&#xC758; Role&#xC5D0;&#xC11C; &#xC62C;&#xBC14;&#xB978; &#xC5ED;&#xD560;&#xC744; &#xBD80;&#xC5EC;&#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. &#xB610;&#xD55C; &#xAD6C;&#xC131;&#xC6D0;&#xC744; &#xC81C;&#xAC70;&#xD558;&#xB824;&#xB294; &#xACBD;&#xC6B0; Delete&#xC758; &#xBC84;&#xD2BC;&#xC744; &#xB204;&#xB974;&#xBA74; &#xAD6C;&#xC131;&#xC6D0;&#xC774; &#xC81C;&#xAC70;&#xB429;&#xB2C8;&#xB2E4;.</p>
</blockquote>
<p><br><br></p>
<h3 id="2-&#xB370;&#xC774;&#xD130;-&#xB2E4;&#xC6B4;&#xB85C;&#xB4DC;">2) &#xB370;&#xC774;&#xD130; &#xB2E4;&#xC6B4;&#xB85C;&#xB4DC;</h3>
<p>DEEP:PHI &#xD50C;&#xB7AB;&#xD3FC;&#xC758; &#xAC01; &#xBAA8;&#xB4C8;&#xC740; &#xC785;/&#xCD9C;&#xB825; &#xB370;&#xC774;&#xD130;&#xB97C; jpeg &#xC774;&#xBBF8;&#xC9C0; &#xD30C;&#xC77C;&#xB85C; &#xB2E4;&#xC6B4;&#xB85C;&#xB4DC;&#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<p><img src="manual_3-6_2_1.png" alt=""></p>
<blockquote>
<p>&#xC704; &#xC774;&#xBBF8;&#xC9C0;&#xC640; &#xAC19;&#xC774; &#xC911;&#xC559; &#xD558;&#xB2E8; &#xC6B0;&#xCE21;&#xC758; Download &#xBC84;&#xD2BC;&#xC744; &#xB204;&#xB974;&#xBA74; &#xB2E4;&#xC6B4;&#xB85C;&#xB4DC; &#xCC3D;&#xC774; &#xD31D;&#xC5C5;&#xB429;&#xB2C8;&#xB2E4;. &#xAC01; &#xBAA8;&#xB4C8;&#xC758; &#xC785;/&#xCD9C;&#xB825; &#xB370;&#xC774;&#xD130;&#xB97C; &#xC804;&#xCCB4; &#xB2E4;&#xC6B4;&#xB85C;&#xB4DC;&#xD558;&#xAC70;&#xB098;, &#xD30C;&#xC77C; &#xB9AC;&#xC2A4;&#xD2B8;&#xC5D0;&#xC11C; &#xD544;&#xC694;&#xD55C; &#xD30C;&#xC77C;&#xB4E4;&#xB9CC; &#xC120;&#xD0DD;&#xD558;&#xC5EC; &#xB2E4;&#xC6B4;&#xB85C;&#xB4DC;&#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
</blockquote>
<p><br></p>
<p><img src="manual_3-6_2_2.png" alt=""></p>
<blockquote>
<p>&#xB2E4;&#xC6B4;&#xB85C;&#xB4DC; &#xBC84;&#xD2BC; &#xC6B0;&#xCE21;&#xC758; &#xC810;&#xBC84;&#xD2BC;&#xC744; &#xD074;&#xB9AD;&#xD558;&#xB294; &#xACBD;&#xC6B0; &#xC804;&#xCCB4; &#xB2E4;&#xC6B4;&#xB85C;&#xB4DC;&#xB97C; &#xC120;&#xD0DD;&#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. &#xC804;&#xCCB4; &#xB2E4;&#xC6B4;&#xB85C;&#xB4DC;&#xB294; &#xBCC4;&#xB3C4;&#xC758; &#xD30C;&#xC77C; &#xB9AC;&#xC2A4;&#xD2B8; &#xCCB4;&#xD06C;&#xAC00; &#xD544;&#xC694; &#xC5C6;&#xC774; &#xD574;&#xB2F9; &#xBAA8;&#xB4C8;&#xC744; &#xAC70;&#xCE5C; &#xB370;&#xC774;&#xD130; &#xC804;&#xCCB4;&#xAC00; &#xB2E4;&#xC6B4;&#xB85C;&#xB4DC; &#xB429;&#xB2C8;&#xB2E4;.</p>
</blockquote>
<p><br></p>
<p><img src="manual_3-6_2_3.png" alt=""></p>
<blockquote>
<p>&#xC6D0;&#xD558;&#xB294; &#xD30C;&#xC77C;&#xB9CC; &#xB2E4;&#xC6B4;&#xB85C;&#xB4DC;&#xD558;&#xB824;&#xB294; &#xACBD;&#xC6B0; &#xD30C;&#xC77C; &#xB9AC;&#xC2A4;&#xD2B8;&#xC5D0;&#xC11C; &#xC704; &#xC774;&#xBBF8;&#xC9C0;&#xCC98;&#xB7FC; &#xCCB4;&#xD06C;&#xBC15;&#xC2A4;&#xC5D0; &#xC6D0;&#xD558;&#xB294; &#xD30C;&#xC77C;&#xB4E4;&#xC744; &#xACE8;&#xB77C; &#xCCB4;&#xD06C; &#xD45C;&#xC2DC;&#xB97C; &#xD558;&#xACE0; Download &#xBC84;&#xD2BC;&#xC744; &#xB204;&#xB974;&#xBA74; &#xB429;&#xB2C8;&#xB2E4;.</p>
</blockquote>
<p><br></p>
<p><img src="manual_3-6_2_4.png" alt=""></p>
<blockquote>
<p>&#xAC01; &#xBAA8;&#xB4C8;&#xC5D0;&#xC11C; &#xB2E4;&#xC6B4;&#xB85C;&#xB4DC; &#xAC00;&#xB2A5;&#xD55C; &#xD30C;&#xC77C;&#xB4E4;&#xC740; Input &#xB370;&#xC774;&#xD130;(Data Files)&#xC640; Label &#xB370;&#xC774;&#xD130;(Label Files)&#xB97C; &#xBC1B;&#xC744; &#xC218; &#xC788;&#xC73C;&#xBA70; &#xC2E0;&#xACBD;&#xB9DD; &#xBAA8;&#xB4C8;&#xC758; &#xACBD;&#xC6B0; &#xC2E0;&#xACBD;&#xB9DD;&#xC744; &#xAC70;&#xCCD0; &#xC608;&#xCE21;&#xB41C; &#xACB0;&#xACFC;(Prediction Files)&#xB97C; &#xCD94;&#xAC00;&#xB85C; &#xB2E4;&#xC6B4;&#xB85C;&#xB4DC;&#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. &#xC704; &#xC120;&#xD0DD; &#xCC3D;&#xC5D0;&#xC11C; &#xD544;&#xC694;&#xD55C; &#xB370;&#xC774;&#xD130;&#xB9CC; &#xC120;&#xD0DD;&#xD558;&#xC5EC; &#xB2E4;&#xC6B4;&#xB85C;&#xB4DC;&#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
</blockquote>
<p><br></p>
<p><img src="manual_3-6_2_5.png" alt=""></p>
<blockquote>
<p>&#xC124;&#xC815;&#xC744; &#xB9C8;&#xCE58;&#xACE0; Download &#xBC84;&#xD2BC;&#xC744; &#xB204;&#xB974;&#xBA74; &#xC6B0;&#xCE21; &#xD558;&#xB2E8;&#xC5D0; &#xACB0;&#xACFC; &#xBA54;&#xC2DC;&#xC9C0;&#xAC00; &#xD31D;&#xC5C5; &#xB429;&#xB2C8;&#xB2E4;.</p>
</blockquote>
<p><br></p>
<p><img src="manual_3-6_2_6.png" alt=""></p>
<blockquote>
<p>&#xD30C;&#xC77C; &#xD06C;&#xAE30;&#xAC00; &#xD074; &#xACBD;&#xC6B0; &#xC555;&#xCD95;&#xC774; &#xC9C4;&#xD589;&#xB418;&#xACE0; &#xBC31;&#xADF8;&#xB77C;&#xC6B4;&#xB4DC;&#xC5D0;&#xC11C; &#xC791;&#xC5C5;&#xC774; &#xC218;&#xD589;&#xB429;&#xB2C8;&#xB2E4;. OK &#xBC84;&#xD2BC;&#xC744; &#xB204;&#xB974;&#xBA74; &#xD504;&#xB85C;&#xC81D;&#xD2B8; &#xB0B4;&#xC5D0;&#xC11C; &#xACC4;&#xC18D; &#xC791;&#xC5C5;&#xC744; &#xC218;&#xD589;&#xD560; &#xC218; &#xC788;&#xC73C;&#xBA70; Go to download page now &#xBC84;&#xD2BC;&#xC744; &#xB204;&#xB974;&#xBA74; Dashboard&#xC758; Download &#xBA54;&#xB274;&#xB85C; &#xC774;&#xB3D9;&#xD569;&#xB2C8;&#xB2E4;.</p>
</blockquote>
<p><br></p>
<p><img src="manual_3-6_2_7.png" alt=""></p>
<blockquote>
<p>&#xBC31;&#xADF8;&#xB77C;&#xC6B4;&#xB4DC;&#xC5D0;&#xC11C; &#xC791;&#xC5C5;&#xB41C; &#xB2E4;&#xC6B4;&#xB85C;&#xB4DC; &#xC694;&#xCCAD;&#xC740; Dashboard&#xC758; Download &#xBA54;&#xB274;&#xC5D0;&#xC11C; &#xD655;&#xC778; &#xAC00;&#xB2A5;&#xD569;&#xB2C8;&#xB2E4;.</p>
</blockquote>
<p><br></p>
<p><img src="manual_3-6_2_8.png" alt=""></p>
<blockquote>
<p>&#xBC31;&#xADF8;&#xB77C;&#xC6B4;&#xB4DC;&#xC5D0;&#xC11C; &#xC555;&#xCD95; &#xC791;&#xC5C5;&#xC774; &#xC218;&#xD589; &#xC911;&#xC774;&#xBA74; &#xC6B0;&#xCE21;&#xC5D0; &#xC9C4;&#xD589;&#xB960;&#xC774; &#xD45C;&#xC2DC; &#xB429;&#xB2C8;&#xB2E4;.<br>&#xC555;&#xCD95; &#xC791;&#xC5C5;&#xC774; &#xC644;&#xB8CC;&#xB418;&#xC5B4; &#xB2E4;&#xC6B4;&#xB85C;&#xB4DC;&#xAC00; &#xAC00;&#xB2A5;&#xD574;&#xC9C0;&#xBA74; &#xC704; &#xC774;&#xBBF8;&#xC9C0;&#xC640; &#xAC19;&#xC774; &#xC6B0;&#xCE21;&#xC5D0; Download &#xBC84;&#xD2BC;&#xC774; &#xD65C;&#xC131;&#xD654;&#xB429;&#xB2C8;&#xB2E4;.<br>&#xD65C;&#xC131;&#xD654;&#xB41C; &#xB2E4;&#xC6B4;&#xB85C;&#xB4DC; &#xB9C1;&#xD06C;&#xB294; &#xB9CC;&#xB8CC; &#xAE30;&#xAC04;&#xC774; &#xC874;&#xC7AC;&#xD558;&#xBA70; &#xB9CC;&#xB8CC; &#xC774;&#xD6C4;&#xC5D4; &#xB2E4;&#xC6B4;&#xB85C;&#xB4DC;&#xD560; &#xC218; &#xC5C6;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
</blockquote>
<p><br></p>
<p><img src="manual_3-6_2_9.png" alt=""></p>
<blockquote>
<p>&#xAE30;&#xD55C;&#xC774; &#xB9CC;&#xB8CC;&#xB418;&#xACE0; &#xB098;&#xC11C; &#xD30C;&#xC77C; &#xB2E4;&#xC6B4;&#xB85C;&#xB4DC;&#xB97C; &#xC218;&#xD589;&#xD558;&#xB824;&#xBA74; &#xB2E4;&#xC2DC; &#xD504;&#xB85C;&#xC81D;&#xD2B8; &#xB0B4;&#xBD80;&#xC5D0;&#xC11C; &#xB2E4;&#xC6B4;&#xB85C;&#xB4DC;&#xB97C; &#xC694;&#xCCAD;&#xD574;&#xC57C; &#xD569;&#xB2C8;&#xB2E4;.</p>
</blockquote>
<p><br><br></p>
<h3 id="3-&#xD14C;&#xC2A4;&#xD2B8;-&#xD504;&#xB85C;&#xC81D;&#xD2B8;&#xB85C;&#xC758;-&#xC804;&#xD658;">3) &#xD14C;&#xC2A4;&#xD2B8; &#xD504;&#xB85C;&#xC81D;&#xD2B8;&#xB85C;&#xC758; &#xC804;&#xD658;</h3>
<blockquote>
<p>&#xD559;&#xC2B5;&#xC774; &#xC644;&#xB8CC;&#xB418;&#xC5B4;&#xC11C; &#xC131;&#xB2A5;&#xC774; &#xCDA9;&#xBD84;&#xD558;&#xB2E4;&#xACE0; &#xD310;&#xB2E8;&#xB418;&#xB294; &#xD504;&#xB85C;&#xC81D;&#xD2B8;&#xB294; &#xD14C;&#xC2A4;&#xD2B8; &#xD504;&#xB85C;&#xC81D;&#xD2B8;&#xB85C; &#xC804;&#xD658;&#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.<br>&#xD14C;&#xC2A4;&#xD2B8; &#xD504;&#xB85C;&#xC81D;&#xD2B8;&#xB294; &#xD559;&#xC2B5;&#xC774; &#xC644;&#xB8CC;&#xB41C; &#xD504;&#xB85C;&#xC81D;&#xD2B8;&#xC5D0;&#xC11C; Deploy &#xD558;&#xC5EC; &#xC2E4;&#xD589;&#xD558;&#xB294;&#xB370;, &#xC774; &#xC2DC;&#xC810;&#xC758; &#xD30C;&#xC774;&#xD504;&#xB77C;&#xC778;&#xACFC; &#xAC01; &#xBAA8;&#xB4C8;&#xC758; &#xC124;&#xC815; &#xC0C1;&#xD0DC; &#xB4F1;&#xC744; &#xADF8;&#xB300;&#xB85C; &#xACE0;&#xC815;&#xC2DC;&#xCF1C; inference&#xB9CC;&#xC744; &#xC218;&#xD589;&#xD558;&#xAC8C; &#xD569;&#xB2C8;&#xB2E4;.<br>&#xC774;&#xB7EC;&#xD55C; &#xD14C;&#xC2A4;&#xD2B8; &#xD504;&#xB85C;&#xC81D;&#xD2B8;&#xB294; &#xCD94;&#xD6C4; &#xACF5;&#xAC1C;&#xB420; DEEP:STORE&#xC744; &#xD1B5;&#xD574; &#xC601;&#xC0C1; &#xD310;&#xB3C5;&#xC744; &#xC218;&#xD589;&#xD558;&#xB294; inference &#xC571;&#xC758; &#xD615;&#xD0DC;&#xB85C; &#xBC30;&#xD3EC;&#xB420; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.<br>&#xAC19;&#xC740; &#xD504;&#xB85C;&#xC81D;&#xD2B8; &#xB0B4;&#xC5D0;&#xC11C; &#xB2E4;&#xC218;&#xC758; &#xD14C;&#xC2A4;&#xD2B8; &#xD504;&#xB85C;&#xC81D;&#xD2B8;&#xAC00; &#xC874;&#xC7AC;&#xD560; &#xC218; &#xC788;&#xC73C;&#xBA70; &#xAC01;&#xAC01;&#xC758; &#xD14C;&#xC2A4;&#xD2B8; &#xD504;&#xB85C;&#xC81D;&#xD2B8;&#xB294; &#xBC84;&#xC804; &#xAD00;&#xB9AC;&#xB97C; &#xD1B5;&#xD574; &#xBCC4;&#xAC1C;&#xC758; &#xD14C;&#xC2A4;&#xD2B8; &#xD504;&#xB85C;&#xC81D;&#xD2B8;&#xB85C; &#xAD00;&#xB9AC;&#xB429;&#xB2C8;&#xB2E4;.</p>
</blockquote>
<p><br></p>
<p><img src="manual_3-6_3_1.png" alt=""></p>
<blockquote>
<p>&#xD559;&#xC2B5;&#xC774; &#xC644;&#xB8CC;&#xB41C; &#xD504;&#xB85C;&#xC81D;&#xD2B8; &#xB0B4;&#xBD80;&#xC5D0;&#xC11C; &#xC704; &#xC774;&#xBBF8;&#xC9C0;&#xCC98;&#xB7FC; &#xC88C;&#xCE21; &#xD0ED;&#xC758; Deployed &#xD0ED;&#xC744; &#xC120;&#xD0DD;&#xD558;&#xC5EC; +Create&#xB97C; &#xD074;&#xB9AD;&#xD558;&#xAC70;&#xB098; &#xC0C1;&#xB2E8; &#xBC14;&#xC758; &#xC88C;&#xCE21;&#xC5D0; &#xC874;&#xC7AC;&#xD558;&#xB294; Train / Test &#xBC84;&#xD2BC;&#xC744; &#xD074;&#xB9AD;&#xD558;&#xC5EC; Train &#xD504;&#xB85C;&#xC81D;&#xD2B8;&#xC5D0;&#xC11C; Test &#xD504;&#xB85C;&#xC81D;&#xD2B8;&#xB85C; &#xD65C;&#xC131;&#xD654;&#xB97C; &#xD558;&#xBA74; &#xD14C;&#xC2A4;&#xD2B8; &#xD504;&#xB85C;&#xC81D;&#xD2B8;&#xB97C; &#xC0DD;&#xC131;&#xD558;&#xB294; &#xC0DD;&#xC131; &#xB9C8;&#xBC95;&#xC0AC;&#xAC00; &#xD31D;&#xC5C5; &#xB429;&#xB2C8;&#xB2E4;.</p>
</blockquote>
<p><br></p>
<p><img src="manual_3-6_3_2.png" alt=""></p>
<blockquote>
<p>&#xD14C;&#xC2A4;&#xD2B8; &#xD504;&#xB85C;&#xC81D;&#xD2B8;&#xC758; &#xC774;&#xB984;&#xACFC; &#xBC84;&#xC804;&#xC744; &#xC785;&#xB825;&#xD55C; &#xB4A4; &#xC800;&#xC7A5;&#xD560; &#xC2E0;&#xACBD;&#xB9DD;&#xC758; &#xC885;&#xB958;&#xB97C; &#xC120;&#xD0DD;&#xD558;&#xACE0; Next&#xB97C; &#xD074;&#xB9AD;&#xD574;&#xC11C; &#xB2E4;&#xC74C; &#xB2E8;&#xACC4;&#xB97C; &#xC9C4;&#xD589;&#xD569;&#xB2C8;&#xB2E4;.<br>&#xB2E4;&#xC74C; &#xB2E8;&#xACC4;&#xC5D0;&#xC120; Test&#xB97C; &#xC218;&#xD589;&#xD560; &#xB54C; &#xAC01; &#xD074;&#xB798;&#xC2A4; &#xBCC4;&#xB85C; &#xD2B9;&#xC815; &#xC218;&#xCE58; &#xC774;&#xC0C1;&#xC778; &#xB370;&#xC774;&#xD130;&#xB4E4;&#xC744; &#xC54C;&#xB78C;&#xC73C;&#xB85C; &#xC54C;&#xB824;&#xC8FC;&#xAE30; &#xC704;&#xD55C; threshold value&#xB97C; &#xC785;&#xB825;&#xD558;&#xAC8C; &#xB429;&#xB2C8;&#xB2E4;.</p>
</blockquote>
<p><br></p>
<p><img src="manual_3-6_3_3.png" alt=""></p>
<blockquote>
<p>&#xC704; &#xC774;&#xBBF8;&#xC9C0;&#xCC98;&#xB7FC; &#xAC01; &#xD074;&#xB798;&#xC2A4;&#xC758; threshold value&#xB97C; 0.5 0.5&#xB77C;&#xACE0; &#xD558;&#xB294; &#xACBD;&#xC6B0; cat class&#xB85C; &#xC608;&#xCE21;&#xB41C; &#xACB0;&#xACFC;&#xC758; &#xD655;&#xB960;&#xC774; 0.5 &#xC774;&#xC0C1;&#xC778; &#xACBD;&#xC6B0; &#xD574;&#xB2F9; &#xB370;&#xC774;&#xD130;&#xAC00; 50% &#xC774;&#xC0C1;&#xC758; &#xD655;&#xB960;&#xB85C; cat class&#xB77C;&#xB294; &#xC54C;&#xB9BC;&#xC774; &#xD45C;&#xC2DC;&#xB429;&#xB2C8;&#xB2E4;.<br>&#xD574;&#xB2F9; &#xAC12;&#xC744; &#xC124;&#xC815;&#xD558;&#xACE0; Next&#xB97C; &#xB204;&#xB974;&#xBA74; &#xB2E4;&#xC74C; &#xB2E8;&#xACC4;&#xB85C; &#xC9C4;&#xD589;&#xC774; &#xB429;&#xB2C8;&#xB2E4;.</p>
</blockquote>
<p><br></p>
<p><img src="manual_3-6_3_4.png" alt=""></p>
<blockquote>
<p>&#xC774; &#xB2E8;&#xACC4;&#xC5D0;&#xC120; &#xB3D9;&#xC77C;&#xD55C; &#xD504;&#xB85C;&#xC81D;&#xD2B8; &#xD30C;&#xC774;&#xD504;&#xB77C;&#xC778; &#xB0B4;&#xC5D0;&#xC11C; &#xAC01; &#xBAA8;&#xB4C8;&#xC758; &#xC124;&#xC815;&#xAC12;&#xB9CC; &#xBC14;&#xAFB8;&#xBA74;&#xC11C; &#xD559;&#xC2B5;&#xC744; &#xBC18;&#xBCF5;&#xC801;&#xC73C;&#xB85C; &#xC218;&#xD589;&#xD558;&#xB294; &#xC2E4;&#xD5D8;&#xC744; &#xC218;&#xD589;&#xD55C; &#xACBD;&#xC6B0; &#xCD5C;&#xC801; &#xC131;&#xB2A5;&#xC758; &#xC124;&#xC815;&#xAC12;&#xC744; &#xC120;&#xD0DD;&#xD560; &#xC218; &#xC788;&#xB3C4;&#xB85D; &#xC0AC;&#xC6A9;&#xC790;&#xC5D0;&#xAC8C; &#xB3C4;&#xC6C0;&#xC744; &#xC81C;&#xACF5;&#xD569;&#xB2C8;&#xB2E4;.<br>&#xC815;&#xD655;&#xB3C4;(Accuracy)&#xB97C; &#xC911;&#xC810;&#xC801;&#xC73C;&#xB85C; &#xD310;&#xB2E8;&#xD560; &#xAC83;&#xC778;&#xC9C0;, &#xC190;&#xC2E4; &#xAC12;(Loss)&#xC744; &#xC911;&#xC810;&#xC801;&#xC73C;&#xB85C; &#xD310;&#xB2E8;&#xD560; &#xAC83;&#xC778;&#xC9C0;, NPV&#xB098; PPV&#xB97C; &#xD310;&#xB2E8; &#xAE30;&#xC900;&#xC73C;&#xB85C; &#xC0BC;&#xC744; &#xAC83;&#xC778;&#xC9C0; &#xC0AC;&#xC6A9;&#xC790;&#xC758; &#xD310;&#xB2E8;&#xC5D0; &#xB530;&#xB77C; &#xD559;&#xC2B5;&#xB41C; &#xC2E0;&#xACBD;&#xB9DD;&#xC744; &#xC120;&#xD0DD;&#xD569;&#xB2C8;&#xB2E4;. &#xAC01; &#xC131;&#xB2A5; &#xC218;&#xCE58;&#xB97C; &#xD074;&#xB9AD;&#xD588;&#xC744; &#xB54C; &#xD558;&#xB298;&#xC0C9;&#xC73C;&#xB85C; &#xD45C;&#xC2DC;&#xB418;&#xB294; &#xC601;&#xC5ED;&#xC774; &#xAC19;&#xC740; &#xC2E0;&#xACBD;&#xB9DD;&#xC785;&#xB2C8;&#xB2E4;.<br>&#xD558;&#xC580;&#xC0C9; &#xC601;&#xC5ED;&#xC744; &#xD074;&#xB9AD;&#xD558;&#xBA74; &#xB2E4;&#xB978; &#xC2E0;&#xACBD;&#xB9DD;&#xC774; &#xC120;&#xD0DD;&#xB429;&#xB2C8;&#xB2E4;. &#xB530;&#xB77C;&#xC11C; &#xC774;&#xB97C; &#xC774;&#xC6A9;&#xD558;&#xC5EC; &#xCD5C;&#xC801;&#xC758; &#xC131;&#xB2A5; &#xC218;&#xCE58;&#xB77C;&#xACE0; &#xD310;&#xB2E8;&#xB418;&#xB294; &#xC131;&#xB2A5;&#xC744; &#xD074;&#xB9AD;&#xD574;&#xC11C; &#xD574;&#xB2F9; &#xC2E0;&#xACBD;&#xB9DD;&#xC744; &#xBC30;&#xD3EC;&#xD558;&#xC5EC; &#xD14C;&#xC2A4;&#xD2B8; &#xD504;&#xB85C;&#xC81D;&#xD2B8;&#xB97C; &#xAD6C;&#xC131;&#xD558;&#xAC8C; &#xB429;&#xB2C8;&#xB2E4;.<br>&#xC120;&#xD0DD;&#xC774; &#xC644;&#xB8CC;&#xB418;&#xC5C8;&#xB2E4;&#xBA74; Next&#xB97C; &#xB20C;&#xB7EC; &#xB2E4;&#xC74C; &#xB2E8;&#xACC4;&#xB97C; &#xC9C4;&#xD589;&#xD569;&#xB2C8;&#xB2E4;.</p>
</blockquote>
<p><br></p>
<p><img src="manual_3-6_3_5.png" alt=""></p>
<blockquote>
<p>&#xB9C8;&#xC9C0;&#xB9C9; &#xB2E8;&#xACC4;&#xC5D0;&#xC120; &#xC120;&#xD0DD;&#xD55C; &#xC2E0;&#xACBD;&#xB9DD;&#xC758; &#xD559;&#xC2B5; &#xB2E8;&#xACC4;(Epoch)&#xC640; &#xADF8; &#xB2F9;&#xC2DC;&#xC758; &#xC131;&#xB2A5; &#xC218;&#xCE58; &#xC0C1;&#xD0DC;&#xB97C; &#xD45C;&#xC2DC;&#xD574; &#xC90D;&#xB2C8;&#xB2E4;.<br>&#xCD5C;&#xC885;&#xC801;&#xC73C;&#xB85C; &#xD574;&#xB2F9; &#xC2E0;&#xACBD;&#xB9DD;&#xC758; &#xC131;&#xB2A5;&#xC744; &#xBC30;&#xD3EC;&#xD574;&#xB3C4; &#xB41C;&#xB2E4;&#xB294; &#xD655;&#xC2E0;&#xC774; &#xB4E0;&#xB2E4;&#xBA74; OK &#xBC84;&#xD2BC;&#xC744; &#xB20C;&#xB7EC; &#xBC30;&#xD3EC;&#xB97C; &#xC644;&#xB8CC;&#xD569;&#xB2C8;&#xB2E4;.</p>
</blockquote>
<p><br></p>
<p><img src="manual_3-6_3_6.png" alt=""></p>
<blockquote>
<p>&#xBC30;&#xD3EC;&#xB41C; &#xD14C;&#xC2A4;&#xD2B8; &#xD504;&#xB85C;&#xC81D;&#xD2B8;&#xB85C; &#xC9C4;&#xC785;&#xD558;&#xBA74; &#xD654;&#xBA74;&#xC740; &#xC704;&#xC640; &#xAC19;&#xC2B5;&#xB2C8;&#xB2E4;.<br>&#xC88C;&#xCE21; Deployed &#xD0ED;&#xC5D0;&#xC120; &#xBC30;&#xD3EC;&#xB41C; &#xD504;&#xB85C;&#xC81D;&#xD2B8;&#xC5D0; &#xB300;&#xD55C; &#xBC84;&#xC804; &#xC815;&#xBCF4;&#xC640; &#xAE30;&#xD0C0; &#xC131;&#xB2A5; &#xC815;&#xBCF4;&#xB97C; &#xD655;&#xC778;&#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. &#xD14C;&#xC2A4;&#xD2B8; &#xD504;&#xB85C;&#xC81D;&#xD2B8;&#xC758; &#xB0B4;&#xC6A9;&#xC744; &#xBCC0;&#xACBD;&#xD558;&#xAC70;&#xB098; &#xBAA8;&#xB4C8;&#xC744; &#xAD50;&#xCCB4;&#xD558;&#xAC70;&#xB098;, &#xB370;&#xC774;&#xD130;&#xC14B;&#xC744; &#xBC14;&#xAFB8;&#xB294; &#xACBD;&#xC6B0; &#xC911;&#xC559; &#xC0C1;&#xB2E8;&#xC758; Restore to initialized ver. &#xBC84;&#xD2BC;&#xC744; &#xD074;&#xB9AD;&#xD558;&#xBA74; &#xD14C;&#xC2A4;&#xD2B8; &#xD504;&#xB85C;&#xC81D;&#xD2B8; &#xC0DD;&#xC131; &#xCD08;&#xAE30; &#xB2E8;&#xACC4;&#xB85C; &#xC6D0;&#xC0C1; &#xBCF5;&#xADC0;&#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
</blockquote>

                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="성능_고도화.html" class="navigation navigation-prev navigation-unique" aria-label="Previous page: 3-5. 성능 고도화">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"3-6. 부가 기능","level":"1.4.6","depth":2,"next":{"title":"4. 부록","level":"1.5","depth":1,"ref":"","articles":[{"title":"4-1. 데이터셋 템플릿","level":"1.5.1","depth":2,"path":"chapter4/데이터셋_템플릿.md","ref":"chapter4/데이터셋_템플릿.md","articles":[]},{"title":"4-2. DEEP:PHI 플랫폼 모듈의 입/출력 데이터 구조","level":"1.5.2","depth":2,"path":"chapter4/DEEPPHI_플랫폼_모듈의_입출력_데이터_구조.md","ref":"chapter4/DEEPPHI_플랫폼_모듈의_입출력_데이터_구조.md","articles":[]},{"title":"4-3. Dicom 파일 비식별화 항목 안내","level":"1.5.3","depth":2,"path":"chapter4/Dicom_파일_비식별화_항목_안내.md","ref":"chapter4/Dicom_파일_비식별화_항목_안내.md","articles":[]},{"title":"4-4. 머신러닝 및 딥러닝 용어 정리","level":"1.5.4","depth":2,"path":"chapter4/머신러닝_및_딥러닝_용어_정리.md","ref":"chapter4/머신러닝_및_딥러닝_용어_정리.md","articles":[]}]},"previous":{"title":"3-5. 성능 고도화","level":"1.4.5","depth":2,"path":"chapter3/성능_고도화.md","ref":"chapter3/성능_고도화.md","articles":[]},"dir":"ltr"},"config":{"gitbook":"*","theme":"default","variables":{},"plugins":[],"pluginsConfig":{"highlight":{},"search":{},"lunr":{"maxIndexSize":1000000,"ignoreSpecialCharacters":false},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"fontsettings":{"theme":"white","family":"sans","size":2},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"}},"file":{"path":"chapter3/부가_기능.md","mtime":"2020-11-24T05:35:50.665Z","type":"markdown"},"gitbook":{"version":"3.2.3","time":"2020-11-24T05:39:42.482Z"},"basePath":"..","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="../gitbook/gitbook.js"></script>
    <script src="../gitbook/theme.js"></script>
    
        
        <script src="../gitbook/gitbook-plugin-search/search-engine.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-search/search.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-lunr/lunr.min.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-lunr/search-lunr.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-sharing/buttons.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

