
<!DOCTYPE HTML>
<html lang="" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>3-3. 파이프라인 생성 · GitBook</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.3">
        
        
        
    
    <link rel="stylesheet" href="../gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-search/search.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="../gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="../gitbook/images/favicon.ico" type="image/x-icon">

    
    <link rel="next" href="성능_평가.html" />
    
    
    <link rel="prev" href="데이터셋_업로드_및_관리하기.html" />
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="Type to search" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    

    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="../">
            
                <a href="../">
            
                    
                    Release Notes
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2" >
            
                <span>
            
                    
                    1. 플랫폼 소개
            
                </span>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.2.1" data-path="../chapter1/딥파이_소개.html">
            
                <a href="../chapter1/딥파이_소개.html">
            
                    
                    1-1. DEEP:PHI 소개
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2.2" data-path="../chapter1/권장사양.html">
            
                <a href="../chapter1/권장사양.html">
            
                    
                    1-2. 권장사양
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2.3" data-path="../chapter1/주요기능.html">
            
                <a href="../chapter1/주요기능.html">
            
                    
                    1-3. 주요기능
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    
        <li class="chapter " data-level="1.3" >
            
                <span>
            
                    
                    2. 화면 구성
            
                </span>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.3.1" data-path="../chapter2/로그인.html">
            
                <a href="../chapter2/로그인.html">
            
                    
                    2-1. 로그인
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.2" data-path="../chapter2/프로젝트_대시보드.html">
            
                <a href="../chapter2/프로젝트_대시보드.html">
            
                    
                    2-2. 프로젝트 대시보드
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.3" data-path="../chapter2/프로젝트_모델러.html">
            
                <a href="../chapter2/프로젝트_모델러.html">
            
                    
                    2-3. 프로젝트 모델러
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    
        <li class="chapter " data-level="1.4" >
            
                <span>
            
                    
                    3. 사용 방법
            
                </span>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.4.1" data-path="프로젝트_구성.html">
            
                <a href="프로젝트_구성.html">
            
                    
                    3-1. 프로젝트 구성
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4.2" data-path="데이터셋_업로드_및_관리하기.html">
            
                <a href="데이터셋_업로드_및_관리하기.html">
            
                    
                    3-2. 데이터셋 업로드 및 관리하기
            
                </a>
            

            
        </li>
    
        <li class="chapter active" data-level="1.4.3" data-path="파이프라인_생성.html">
            
                <a href="파이프라인_생성.html">
            
                    
                    3-3. 파이프라인 생성
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4.4" data-path="성능_평가.html">
            
                <a href="성능_평가.html">
            
                    
                    3-4. 성능 평가
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4.5" data-path="성능_고도화.html">
            
                <a href="성능_고도화.html">
            
                    
                    3-5. 성능 고도화
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4.6" data-path="부가_기능.html">
            
                <a href="부가_기능.html">
            
                    
                    3-6. 부가 기능
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    
        <li class="chapter " data-level="1.5" >
            
                <span>
            
                    
                    4. 부록
            
                </span>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.5.1" data-path="../chapter4/데이터셋_템플릿.html">
            
                <a href="../chapter4/데이터셋_템플릿.html">
            
                    
                    4-1. 데이터셋 템플릿
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.5.2" data-path="../chapter4/DEEPPHI_플랫폼_모듈의_입출력_데이터_구조.html">
            
                <a href="../chapter4/DEEPPHI_플랫폼_모듈의_입출력_데이터_구조.html">
            
                    
                    4-2. DEEP:PHI 플랫폼 모듈의 입/출력 데이터 구조
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.5.3" data-path="../chapter4/Dicom_파일_비식별화_항목_안내.html">
            
                <a href="../chapter4/Dicom_파일_비식별화_항목_안내.html">
            
                    
                    4-3. Dicom 파일 비식별화 항목 안내
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.5.4" data-path="../chapter4/머신러닝_및_딥러닝_용어_정리.html">
            
                <a href="../chapter4/머신러닝_및_딥러닝_용어_정리.html">
            
                    
                    4-4. 머신러닝 및 딥러닝 용어 정리
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    
        <li class="chapter " data-level="1.6" >
            
                <span>
            
                    
                    5. History
            
                </span>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.6.1" data-path="../release/2020-04.1126016.html">
            
                <a href="../release/2020-04.1126016.html">
            
                    
                    Version 2020-04.1126016
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            Published with GitBook
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href=".." >3-3. 파이프라인 생성</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <h1 id="3-&#xC0AC;&#xC6A9;-&#xBC29;&#xBC95;">3. &#xC0AC;&#xC6A9; &#xBC29;&#xBC95;</h1>
<hr>
<h2 id="3-3-&#xD30C;&#xC774;&#xD504;&#xB77C;&#xC778;-&#xC0DD;&#xC131;">3-3. &#xD30C;&#xC774;&#xD504;&#xB77C;&#xC778; &#xC0DD;&#xC131;</h2>
<p>DEEP:PHI &#xD50C;&#xB7AB;&#xD3FC;&#xC758; &#xD575;&#xC2EC;&#xC740; Flow space&#xC5D0;&#xC11C; &#xC88C;&#xCE21;&#xC758; &#xBAA8;&#xB4C8;&#xB4E4;&#xC744; &#xD3B8;&#xB9AC;&#xD558;&#xAC8C; &#xB4DC;&#xB798;&#xADF8;&amp;&#xB4DC;&#xB86D;&#xC73C;&#xB85C; &#xC0AC;&#xC6A9;&#xD558;&#xB294; &#xAC83;&#xC785;&#xB2C8;&#xB2E4;. &#xC0DD;&#xC131;&#xB41C; &#xBAA8;&#xB4C8;&#xB4E4;&#xC740; &#xC5F0;&#xACB0; &#xBC29;&#xD5A5; &#xAE30;&#xC900; &#xC88C;&#xCE21;&#xC5D0;&#xC11C; &#xC6B0;&#xCE21;&#xC73C;&#xB85C; &#xB370;&#xC774;&#xD130;&#xAC00; &#xC790;&#xB3D9;&#xC73C;&#xB85C; &#xC774;&#xB3D9;&#xD558;&#xBA70; &#xBAA8;&#xB4C8;&#xBCC4;&#xB85C; &#xC5F0;&#xC0B0;&#xC744; &#xC218;&#xD589;&#xD569;&#xB2C8;&#xB2E4;. &#xAC01; &#xBAA8;&#xB4C8;&#xC758; &#xC785;/&#xCD9C;&#xB825; &#xACB0;&#xACFC;&#xB3C4; &#xD50C;&#xB7AB;&#xD3FC; &#xC0C1;&#xC5D0;&#xC11C; &#xBC14;&#xB85C; &#xD655;&#xC778; &#xAC00;&#xB2A5;&#xD558;&#xAE30; &#xB54C;&#xBB38;&#xC5D0; &#xBE60;&#xB974;&#xACE0; &#xD3B8;&#xB9AC;&#xD558;&#xAC8C; &#xC5F0;&#xAD6C;&#xB97C; &#xC218;&#xD589;&#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<p>&#xC758;&#xB8CC; &#xC601;&#xC0C1;&#xC744; &#xD65C;&#xC6A9;&#xD55C; &#xC778;&#xACF5;&#xC9C0;&#xB2A5; &#xC5F0;&#xAD6C; &#xB2E8;&#xACC4;&#xB294; &#xD06C;&#xAC8C; 4&#xB2E8;&#xACC4;&#xB85C; &#xAD6C;&#xBD84;&#xB418;&#xBA70; &#xB370;&#xC774;&#xD130;&#xC14B; &#xC5C5;&#xB85C;&#xB4DC; - &#xB370;&#xC774;&#xD130;&#xC14B; &#xAC00;&#xACF5; - &#xC2E0;&#xACBD;&#xB9DD; &#xD559;&#xC2B5; - &#xACB0;&#xACFC; &#xBD84;&#xC11D; &#xB4F1;&#xC73C;&#xB85C; &#xAD6C;&#xC131;&#xB418;&#xC5B4; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. DEEP:PHI &#xD50C;&#xB7AB;&#xD3FC;&#xC5D0;&#xC120; &#xAC01; &#xB2E8;&#xACC4;&#xBCC4;&#xB85C; &#xB2E4;&#xC591;&#xD55C; &#xC218;&#xD589;&#xAE30;&#xB2A5;&#xB4E4;&#xC744; &#xBAA8;&#xB4C8;&#xD654;&#xD558;&#xC5EC; &#xBCC4;&#xB3C4;&#xC758; &#xCF54;&#xB529;&#xC791;&#xC5C5; &#xC5C6;&#xC774; &#xC190;&#xC27D;&#xAC8C; &#xC0AC;&#xC6A9;&#xC790;&#xB4E4;&#xC774; &#xC0AC;&#xC6A9;&#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<p>DEEP:PHI &#xD50C;&#xB7AB;&#xD3FC;&#xC758; &#xBAA8;&#xB4C8; &#xAD6C;&#xC131;&#xC740; Dataset, Image Processing, Neural Network, Data Manipulation&#xC73C;&#xB85C; &#xAD6C;&#xBD84;&#xB418;&#xC5B4; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.<br>Dataset &#xBAA8;&#xB4C8;&#xC740; &#xC0AC;&#xC6A9;&#xC790;&#xAC00; &#xB370;&#xC774;&#xD130;&#xC14B;&#xC744; &#xC5C5;&#xB85C;&#xB4DC;&#xD574;&#xC11C; &#xC0AC;&#xC6A9;&#xD558;&#xB294; &#xC0AC;&#xC6A9;&#xC790; &#xB370;&#xC774;&#xD130;&#xC14B; &#xBAA8;&#xB4C8;&#xACFC; &#xB525;&#xB178;&#xC774;&#xB4DC;&#xC5D0;&#xC11C; &#xACF5;&#xC720;&#xD558;&#xACE0; &#xC788;&#xB294; Shared &#xB370;&#xC774;&#xD130;&#xC14B; &#xBAA8;&#xB4C8;&#xB85C; &#xAD6C;&#xBD84;&#xB418;&#xC5B4; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. &#xB370;&#xC774;&#xD130;&#xC14B;&#xC744; &#xC5C5;&#xB85C;&#xB4DC;&#xD558;&#xBA74; &#xC5C5;&#xB85C;&#xB4DC; &#xACFC;&#xC815;&#xC5D0;&#xC11C; &#xC785;&#xB825;&#xD55C; &#xC815;&#xBCF4;&#xB300;&#xB85C; &#xB370;&#xC774;&#xD130;&#xC14B;&#xC758; &#xCD2C;&#xC601; &#xBD80;&#xC704;&#xB85C; &#xAD6C;&#xBD84;&#xB418;&#xC5B4; Dataset &#xCE74;&#xD14C;&#xACE0;&#xB9AC; &#xC0C1;&#xC5D0;&#xC11C; &#xD574;&#xB2F9; &#xCE74;&#xD14C;&#xACE0;&#xB9AC;&#xB85C; &#xCC3E;&#xC544;&#xAC00;&#xAC70;&#xB098; &#xAC80;&#xC0C9;&#xCC3D;&#xC5D0;&#xC11C; &#xC5C5;&#xB85C;&#xB4DC;&#xD55C; &#xB370;&#xC774;&#xD130;&#xC14B;&#xC758; &#xC774;&#xB984;&#xC744; &#xAC80;&#xC0C9;&#xD558;&#xC5EC; &#xC88C;&#xCE21; &#xBA54;&#xB274;&#xC5D0;&#xC11C; &#xC911;&#xC559;&#xC758; Flow space&#xB85C; &#xB4DC;&#xB798;&#xADF8;&amp;&#xB4DC;&#xB86D;&#xD558;&#xC5EC; &#xC0AC;&#xC6A9;&#xD569;&#xB2C8;&#xB2E4;.</p>
<p><br></p>
<h3 id="1-dataset-&#xBAA8;&#xB4C8;&#xB85C;-&#xB370;&#xC774;&#xD130;&#xC14B;-&#xBD88;&#xB7EC;&#xC624;&#xAE30;">1) Dataset &#xBAA8;&#xB4C8;&#xB85C; &#xB370;&#xC774;&#xD130;&#xC14B; &#xBD88;&#xB7EC;&#xC624;&#xAE30;</h3>
<p><img src="manual_3-3_1_1.png" alt=""></p>
<blockquote>
<ul>
<li>&#xC5C5;&#xB85C;&#xB4DC;&#xB41C; &#xB370;&#xC774;&#xD130;&#xC14B;&#xC740; &#xCD2C;&#xC601; &#xBD80;&#xC704;&#xBCC4;&#xB85C; &#xAD6C;&#xBD84;&#xB418;&#xC5B4; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.  </li>
<li>Shared Dataset&#xC740; &#xBCC4;&#xB3C4;&#xC758; &#xD45C;&#xC2DC;&#xAC00; &#xB418;&#xC5B4;&#xC788;&#xC9C0; &#xC54A;&#xC73C;&#xBA70; &#xC0AC;&#xC6A9;&#xC790;&#xAC00; &#xC9C1;&#xC811; &#xC5C5;&#xB85C;&#xB4DC;&#xD55C; &#xB370;&#xC774;&#xD130;&#xC14B;&#xC740; &#xB370;&#xC774;&#xD130;&#xC14B; &#xBAA8;&#xB4C8; &#xC774;&#xB984; &#xC88C;&#xCE21;&#xC5D0; My &#xD0DC;&#xADF8;&#xAC00; &#xD45C;&#xC2DC;&#xB418;&#xC5B4; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.  </li>
<li>+Create &#xBC84;&#xD2BC;&#xC744; &#xB20C;&#xB7EC; &#xB370;&#xC774;&#xD130;&#xC14B; &#xC5C5;&#xB85C;&#xB4DC;&#xB97C; &#xC218;&#xD589;&#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</li>
</ul>
</blockquote>
<p><br></p>
<p><img src="manual_3-3_1_2.png" alt=""></p>
<blockquote>
<ul>
<li>&#xC0AC;&#xC6A9;&#xD558;&#xACE0;&#xC790; &#xD558;&#xB294; &#xB370;&#xC774;&#xD130;&#xC14B;&#xC744; &#xD074;&#xB9AD;&#xD574;&#xC11C; Flow space&#xB85C; &#xAC00;&#xC838;&#xAC04; &#xB2E4;&#xC74C;(&#xB4DC;&#xB798;&#xADF8;) &#xD074;&#xB9AD; &#xD574;&#xC81C;(&#xB4DC;&#xB78D;)&#xD558;&#xBA74; Flow space&#xC5D0; &#xB370;&#xC774;&#xD130;&#xC14B;&#xC774; &#xC0DD;&#xC131;&#xB429;&#xB2C8;&#xB2E4;.</li>
</ul>
</blockquote>
<p><br></p>
<p><img src="manual_3-3_1_3.png" alt=""></p>
<blockquote>
<ul>
<li>&#xC911;&#xC559; &#xD558;&#xB2E8;&#xC740; &#xB370;&#xC774;&#xD130;&#xC14B;&#xC744; &#xD655;&#xC778;&#xD558;&#xACE0; &#xBAA8;&#xB4C8;&#xC758; &#xC2E4;&#xD589; &#xB85C;&#xADF8;&#xB97C; &#xD655;&#xC778;&#xD558;&#xB294; &#xACF5;&#xAC04;&#xC785;&#xB2C8;&#xB2E4;.  </li>
<li>&#xC6B0;&#xCE21; &#xC601;&#xC5ED;&#xC740; &#xD574;&#xB2F9; &#xBAA8;&#xB4C8;&#xC758; &#xC815;&#xBCF4;&#xC640; &#xB370;&#xC774;&#xD130; &#xC2DC;&#xAC01;&#xD654;, &#xC18D;&#xC131;&#xAC12; &#xB4F1;&#xC744; &#xD655;&#xC778;&#xD558;&#xB294; &#xACF5;&#xAC04;&#xC785;&#xB2C8;&#xB2E4;.</li>
</ul>
</blockquote>
<p><br><br></p>
<h3 id="2-image-processing-&#xBAA8;&#xB4C8;-&#xC0AC;&#xC6A9;&#xD558;&#xAE30;">2) Image Processing &#xBAA8;&#xB4C8; &#xC0AC;&#xC6A9;&#xD558;&#xAE30;</h3>
<p>Image Processing&#xC740; &#xC77C;&#xBC18;&#xC801;&#xC73C;&#xB85C; &#xC601;&#xC0C1;&#xCC98;&#xB9AC;&#xB97C; &#xC758;&#xBBF8;&#xD569;&#xB2C8;&#xB2E4;.<br>DEEP:PHI &#xD50C;&#xB7AB;&#xD3FC;&#xC5D0;&#xC120; &#xB2E4;&#xC591;&#xD55C; &#xC601;&#xC0C1;&#xCC98;&#xB9AC; &#xC54C;&#xACE0;&#xB9AC;&#xC998;&#xC744; &#xD65C;&#xC6A9;&#xD558;&#xC5EC; &#xC758;&#xB8CC; &#xC601;&#xC0C1; &#xB370;&#xC774;&#xD130;&#xB97C; &#xAC00;&#xACF5;&#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.<br>&#xC778;&#xACF5;&#xC9C0;&#xB2A5; &#xC54C;&#xACE0;&#xB9AC;&#xC998;&#xC758; &#xD575;&#xC2EC;&#xC774; &#xB418;&#xB294; &#xC2E0;&#xACBD;&#xB9DD;&#xC740; &#xC785;&#xB825; &#xB370;&#xC774;&#xD130;&#xC758; &#xD615;&#xD0DC;&#xC5D0; &#xB530;&#xB77C; &#xD559;&#xC2B5; &#xC131;&#xB2A5;&#xC774; &#xC720;&#xC758;&#xBBF8;&#xD55C; &#xCC28;&#xC774;&#xB97C; &#xBCF4;&#xC785;&#xB2C8;&#xB2E4;.<br>&#xB530;&#xB77C;&#xC11C; &#xB2E8;&#xC21C;&#xD788; Raw &#xB370;&#xC774;&#xD130;&#xB97C; &#xADF8;&#xB300;&#xB85C; &#xC2E0;&#xACBD;&#xB9DD;&#xC5D0; &#xC785;&#xB825;&#xD558;&#xB294; &#xAC83;&#xC774; &#xC544;&#xB2C8;&#xB77C; &#xAC01; &#xB370;&#xC774;&#xD130;&#xC14B;&#xC5D0; &#xB9DE;&#xAC8C;, &#xC0AC;&#xC6A9;&#xC790;&#xAC00; &#xC6D0;&#xD558;&#xB294; &#xC5F0;&#xAD6C;&#xBAA9;&#xC801;&#xC5D0; &#xB9DE;&#xAC8C; &#xB370;&#xC774;&#xD130;&#xB97C; &#xAC00;&#xACF5;&#xD574;&#xC11C; &#xC2E0;&#xACBD;&#xB9DD;&#xC5D0; &#xC785;&#xB825;&#xD558;&#xB294; &#xAC83;&#xC774; &#xC131;&#xB2A5;&#xC744; &#xB192;&#xC77C; &#xC218; &#xC788;&#xB294; &#xC88B;&#xC740; &#xBC29;&#xBC95;&#xC785;&#xB2C8;&#xB2E4;.<br>&#xB370;&#xC774;&#xD130;&#xC14B; &#xBAA8;&#xB4C8;&#xACFC; &#xB9C8;&#xCC2C;&#xAC00;&#xC9C0;&#xB85C; Image Processing &#xBAA8;&#xB4C8; &#xC5ED;&#xC2DC; &#xC88C;&#xCE21; &#xBA54;&#xB274;&#xC5D0;&#xC11C; &#xB4DC;&#xB798;&#xADF8;&amp;&#xB4DC;&#xB86D;&#xC73C;&#xB85C; &#xAC04;&#xD3B8;&#xD558;&#xAC8C; Flow space&#xC5D0;&#xC11C; &#xBAA8;&#xB4C8; &#xAC04; &#xC5F0;&#xACB0;&#xC744; &#xD1B5;&#xD574; &#xC0AC;&#xC6A9;&#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.<br>&#xB610;&#xD55C; Custom &#xAE30;&#xB2A5;&#xC774; &#xD544;&#xC694;&#xD55C; &#xACBD;&#xC6B0;&#xB97C; &#xB300;&#xBE44;&#xD574; &#xC0AC;&#xC6A9;&#xC790;&#xAC00; &#xC9C1;&#xC811; &#xCF54;&#xB4DC; &#xC791;&#xC5C5;&#xC774; &#xAC00;&#xB2A5;&#xD55C; &#xD30C;&#xC774;&#xC36C; &#xCF54;&#xB4DC; &#xC5D0;&#xB514;&#xD130;&#xB97C; &#xBCC4;&#xB3C4;&#xB85C; &#xC81C;&#xACF5;&#xD558;&#xACE0; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<p><br></p>
<p><img src="manual_3-3_2_1.png" alt=""></p>
<blockquote>
<p>&#x2460; &#xB370;&#xC774;&#xD130;&#xC14B; &#xBAA8;&#xB4C8;&#xC758; &#xC624;&#xB978;&#xCABD; &#xC601;&#xC5ED;&#xC5D0; &#xC0AC;&#xC6A9;&#xD560; &#xC601;&#xC0C1;&#xCC98;&#xB9AC; &#xBAA8;&#xB4C8;&#xC744; &#xB4DC;&#xB798;&#xADF8;&amp;&#xB4DC;&#xB86D;&#xD558;&#xC5EC; &#xBC30;&#xCE58;&#xD569;&#xB2C8;&#xB2E4;.</p>
</blockquote>
<p><img src="manual_3-3_2_2.png" alt=""></p>
<blockquote>
<p>&#x2461; &#xBC30;&#xCE58;&#xD55C; &#xBAA8;&#xB4C8;&#xC744; &#xBAA8;&#xB4C8; &#xC544;&#xC774;&#xCF58;&#xC758; &#xAC00;&#xC6B4;&#xB370;&#xC5D0; &#xCEE4;&#xC11C;&#xB97C; &#xB450;&#xBA74; &#xC5F0;&#xACB0; &#xBAA8;&#xB4DC;&#xAC00; &#xD65C;&#xC131;&#xD654;&#xB429;&#xB2C8;&#xB2E4;(&#xD074;&#xB9BD;&#xBAA8;&#xC591; &#xD45C;&#xC2DC;).<br>&#xD074;&#xB9BD; &#xC544;&#xC774;&#xCF58;&#xC744; &#xD074;&#xB9AD;&#xD55C; &#xC0C1;&#xD0DC;&#xC5D0;&#xC11C; &#xB4DC;&#xB798;&#xADF8;&#xD558;&#xACE0; &#xB2E4;&#xC74C; &#xBAA8;&#xB4C8;&#xB85C; &#xC5F0;&#xACB0;&#xD558;&#xBA74; &#xC704; &#xC0AC;&#xC9C4;&#xACFC; &#xAC19;&#xC774; &#xB179;&#xC0C9; &#xC120;&#xC774; &#xC5F0;&#xACB0;&#xB418;&#xACE0;, &#xD074;&#xB9AD; &#xD574;&#xC81C;&#xB97C; &#xD558;&#xBA74; &#xBAA8;&#xB4C8;&#xB4E4;&#xC774; &#xD654;&#xC0B4;&#xD45C;&#xB85C; &#xC5F0;&#xACB0;&#xB429;&#xB2C8;&#xB2E4;.</p>
</blockquote>
<p><img src="manual_3-3_2_3.png" alt=""></p>
<blockquote>
<p>&#x2462; &#xAC01; Image Processing &#xBAA8;&#xB4C8;&#xC740; &#xBAA8;&#xB4C8;&#xC758; &#xAE30;&#xB2A5;&#xACFC; &#xC0C1;&#xC138; &#xC124;&#xBA85;, &#xD65C;&#xC6A9; &#xC608;&#xC2DC;&#xAC00; &#xC6B0;&#xCE21; Information &#xD0ED;&#xC5D0; &#xC785;&#xB825;&#xB418;&#xC5B4; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.<br>&#xD574;&#xB2F9; Information&#xC744; &#xC77D;&#xC5B4;&#xBCF4;&#xACE0; &#xC0C1;&#xD669;&#xC5D0; &#xB9DE;&#xB294; &#xBAA8;&#xB4C8;&#xC744; &#xC0AC;&#xC6A9;&#xD558;&#xBA74; &#xB429;&#xB2C8;&#xB2E4;.</p>
</blockquote>
<p><img src="manual_3-3_2_4.png" alt=""></p>
<blockquote>
<p>&#x2463; Information &#xD0ED; &#xC544;&#xB798;&#xC5D0;&#xB294; &#xD574;&#xB2F9; &#xBAA8;&#xB4C8;&#xC758; &#xC124;&#xC815;&#xAC12;&#xC744; &#xBCC0;&#xACBD;&#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
</blockquote>
<p><img src="manual_3-3_2_5.png" alt=""></p>
<blockquote>
<p>&#x2464; Attribute &#xD0ED;&#xC5D0;&#xC120; &#xC120;&#xD0DD;&#xD55C; &#xB370;&#xC774;&#xD130;&#xC5D0; &#xB300;&#xD55C; &#xB2E4;&#xC591;&#xD55C; &#xC18D;&#xC131;&#xAC12;&#xC744; &#xD655;&#xC778;&#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
</blockquote>
<p><img src="manual_3-3_2_6.png" alt=""></p>
<blockquote>
<p>&#x2465; &#xB370;&#xC774;&#xD130;&#xC14B; &#xBAA8;&#xB4C8;&#xACFC; Image Processing &#xBAA8;&#xB4C8;&#xC744; &#xC5F0;&#xACB0;&#xD558;&#xACE0; &#xC2E4;&#xD589;&#xC2DC;&#xD0A4;&#xBA74; &#xAC01; &#xBAA8;&#xB4C8; &#xBCC4; Output &#xACB0;&#xACFC;&#xB97C; &#xC624;&#xB978;&#xCABD; Processing Result &#xD0ED;&#xC5D0;&#xC11C; &#xD655;&#xC778;&#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.<br>&#xC704; &#xC608;&#xC2DC;&#xCC98;&#xB7FC; &#xC601;&#xC0C1;&#xC774; &#xAC01; &#xBAA8;&#xB4C8;&#xC744; &#xAC70;&#xCE58;&#xBA74;&#xC11C; &#xC5B4;&#xB5BB;&#xAC8C; &#xBCC0;&#xD654;&#xD558;&#xB294;&#xC9C0; &#xC9C1;&#xC811; &#xB208;&#xC73C;&#xB85C; &#xD655;&#xC778;&#xD560; &#xC218; &#xC788;&#xC73C;&#xBA70; &#xC774;&#xB7EC;&#xD55C; &#xACFC;&#xC815;&#xC744; &#xD1B5;&#xD574; &#xC5B4;&#xB5A4; &#xBAA8;&#xB4C8;&#xC744; &#xC0AC;&#xC6A9;&#xD574; &#xB370;&#xC774;&#xD130;&#xC14B;&#xC744; &#xAC00;&#xACF5;&#xD560;&#xC9C0; &#xC5F0;&#xAD6C;&#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
</blockquote>
<p><br><br></p>
<h3 id="3-neural-network-&#xBAA8;&#xB4C8;-&#xC0AC;&#xC6A9;&#xD558;&#xAE30;">3) Neural Network &#xBAA8;&#xB4C8; &#xC0AC;&#xC6A9;&#xD558;&#xAE30;</h3>
<p>&#xB9C8;&#xC9C0;&#xB9C9; &#xB2E8;&#xACC4;&#xB85C; &#xC774;&#xC81C; &#xAC00;&#xACF5;&#xD55C; &#xB370;&#xC774;&#xD130;&#xC14B;&#xC744; &#xC2E0;&#xACBD;&#xB9DD;&#xC5D0; &#xC785;&#xB825;&#xD558;&#xC5EC; &#xD559;&#xC2B5;&#xACFC;&#xC815;&#xC744; &#xC218;&#xD589;&#xD569;&#xB2C8;&#xB2E4;.<br>DEEP:PHI &#xD50C;&#xB7AB;&#xD3FC;&#xC758; &#xC778;&#xACF5;&#xC9C0;&#xB2A5; &#xC54C;&#xACE0;&#xB9AC;&#xC998;&#xB4E4;&#xC740; &#xC9C0;&#xB3C4;&#xD559;&#xC2B5;(Supervised Learning) &#xAE30;&#xBC18;&#xC758; &#xC778;&#xACF5;&#xC9C0;&#xB2A5; &#xC54C;&#xACE0;&#xB9AC;&#xC998;&#xB4E4;&#xC774; &#xD0D1;&#xC7AC;&#xB418;&#xC5B4; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.<br>&#xC2E0;&#xACBD;&#xB9DD;(Neural Network)&#xC740; &#xC0DD;&#xBB3C;&#xC758; &#xC2E0;&#xACBD;&#xACC4;&#xB97C; &#xC218;&#xD559;&#xC801;&#xC73C;&#xB85C; &#xBAA8;&#xC0AC;&#xD558;&#xC5EC; &#xC791;&#xB3D9;&#xD558;&#xB3C4;&#xB85D; &#xC124;&#xACC4;&#xB41C; &#xC54C;&#xACE0;&#xB9AC;&#xC998;&#xC785;&#xB2C8;&#xB2E4;.<br>&#xB2E4;&#xC591;&#xD55C; &#xBC29;&#xBC95;&#xC744; &#xC0AC;&#xC6A9;&#xD574;&#xC11C; &#xC785;&#xB825; &#xB370;&#xC774;&#xD130;&#xB85C;&#xBD80;&#xD130; &#xC758;&#xBBF8;&#xC788;&#xB294; &#xD2B9;&#xC9D5;(Feature)&#xB4E4;&#xC744; &#xCD94;&#xCD9C;&#xD558;&#xACE0; &#xC774; &#xD2B9;&#xC9D5;&#xB4E4;&#xC744; &#xAC01; &#xC2E0;&#xACBD;&#xB9DD; &#xB178;&#xB4DC;&#xB4E4;&#xC774; &#xD559;&#xC2B5;&#xD558;&#xBA74;&#xC11C; &#xC815;&#xB2F5;&#xC744; &#xCC3E;&#xC544;&#xAC00;&#xB3C4;&#xB85D; &#xB9CC;&#xB4E4;&#xC5B4;&#xC838; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.<br>&#xD06C;&#xAC8C; &#xC0AC;&#xC6A9;&#xC790;&#xAC00; &#xC2E0;&#xACBD;&#xB9DD;&#xC744; &#xD1B5;&#xD574; &#xB370;&#xC774;&#xD130;&#xB97C; &#xBD84;&#xC11D;&#xD558;&#xB824;&#xB294; &#xBAA9;&#xC801;&#xC5D0; &#xB530;&#xB77C; Classification, Segmentation, Object Detection&#xC73C;&#xB85C; &#xC2E0;&#xACBD;&#xB9DD;&#xC758; &#xC5ED;&#xD560;&#xC744; &#xB098;&#xB20C; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<p><br></p>
<blockquote>
<ul>
<li><p>Classification : &#xC785;&#xB825; &#xB370;&#xC774;&#xD130;&#xB97C; &#xD1B5;&#xD574; &#xB370;&#xC774;&#xD130;&#xC758; Class&#xB97C; &#xBD84;&#xB958;&#xD558;&#xB294; &#xC791;&#xC5C5;&#xC744; &#xC218;&#xD589;&#xD569;&#xB2C8;&#xB2E4;.<br>&#xA0;&#xA0;&#xA0;&#xA0;<em>ex) &#xC815;&#xC0C1; &#xD658;&#xC790; vs &#xBE44;&#xC815;&#xC0C1; &#xD658;&#xC790;&#xC758; &#xAD6C;&#xBD84;, &#xC591;&#xC131; &#xC885;&#xC591; vs &#xC545;&#xC131; &#xC885;&#xC591;&#xC758; &#xAD6C;&#xBD84; &#xB4F1;</em></p>
</li>
<li><p>Segmentation : &#xC785;&#xB825; &#xB370;&#xC774;&#xD130;&#xB97C; &#xD1B5;&#xD574; &#xB370;&#xC774;&#xD130;&#xC758; &#xD2B9;&#xC815; &#xC601;&#xC5ED;&#xC744; &#xBD84;&#xD560;&#xD558;&#xB294; &#xC791;&#xC5C5;&#xC744; &#xC218;&#xD589;&#xD569;&#xB2C8;&#xB2E4;.<br>&#xA0;&#xA0;&#xA0;&#xA0;<em>ex) Brain MRI &#xC601;&#xC0C1;&#xC5D0;&#xC11C; enhancing tumor, tumor core, whole tumor&#xB97C; &#xAD6C;&#xBD84;&#xD558;&#xC5EC; &#xCD94;&#xCD9C;</em></p>
</li>
<li><p>Detection : &#xC785;&#xB825; &#xB370;&#xC774;&#xD130;&#xB97C; &#xD1B5;&#xD574; &#xB370;&#xC774;&#xD130;&#xC5D0;&#xC11C; &#xBB3C;&#xCCB4;&#xC758; &#xC704;&#xCE58;&#xB97C; &#xD0D0;&#xC9C0;&#xD558;&#xB294; &#xC791;&#xC5C5;&#xC744; &#xC218;&#xD589;&#xD569;&#xB2C8;&#xB2E4;.<br>&#xA0;&#xA0;&#xA0;&#xA0;<em>ex) Lung CT &#xC601;&#xC0C1;&#xC5D0;&#xC11C; Lung Nodule&#xC758; &#xC704;&#xCE58;&#xB97C; &#xC88C;&#xD45C;&#xB85C; &#xD0D0;&#xC9C0;</em></p>
</li>
</ul>
</blockquote>
<p><br></p>
<p>DEEP:PHI &#xD50C;&#xB7AB;&#xD3FC;&#xC5D0;&#xC120; &#xC778;&#xACF5;&#xC9C0;&#xB2A5; &#xC5F0;&#xAD6C;&#xC6D0;&#xB4E4;&#xC774; &#xC2E4;&#xC81C; &#xC5F0;&#xAD6C; &#xACFC;&#xC815;&#xC5D0;&#xC11C; &#xC0AC;&#xC6A9;&#xD558;&#xACE0; &#xC788;&#xB294; &#xB2E4;&#xC591;&#xD55C; &#xC885;&#xB958;&#xC758; &#xC2E0;&#xACBD;&#xB9DD;&#xB4E4;&#xC744; &#xC9C0;&#xC18D;&#xC801;&#xC73C;&#xB85C; &#xD50C;&#xB7AB;&#xD3FC;&#xC5D0; &#xC5C5;&#xB370;&#xC774;&#xD2B8;&#xD558;&#xACE0; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.<br>&#xAC01; &#xC2E0;&#xACBD;&#xB9DD;&#xB4E4;&#xC740; &#xC704; &#xBD84;&#xC11D; &#xBAA9;&#xC801;&#xC5D0; &#xB530;&#xB77C; &#xBD84;&#xB958;&#xB418;&#xC5B4; &#xC788;&#xC73C;&#xBA70; Dataset &#xBAA8;&#xB4C8;, Image Processing &#xBAA8;&#xB4C8;&#xACFC; &#xB9C8;&#xCC2C;&#xAC00;&#xC9C0;&#xB85C; &#xB4DC;&#xB798;&#xADF8;&amp;&#xB4DC;&#xB86D;&#xC744; &#xD1B5;&#xD574; &#xBAA8;&#xB4C8;&#xC744; Flow space&#xB85C; &#xAC00;&#xC838;&#xC624;&#xACE0; &#xBAA8;&#xB4C8;&#xB07C;&#xB9AC; &#xC5F0;&#xACB0;&#xD558;&#xC5EC; &#xC0AC;&#xC6A9;&#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.<br>&#xB610;&#xD55C; &#xC2E0;&#xACBD;&#xB9DD; &#xAD6C;&#xC870;&#xB97C; &#xC9C1;&#xC811; &#xBCC0;&#xACBD;&#xD558;&#xACE0;&#xC790; &#xD558;&#xB294; &#xC0AC;&#xC6A9;&#xC790;&#xB4E4;&#xC744; &#xC704;&#xD574; &#xBE14;&#xB7ED; &#xC7A5;&#xB09C;&#xAC10;&#xC744; &#xC870;&#xB9BD;&#xD558;&#xB4EF;&#xC774; &#xC2E0;&#xACBD;&#xB9DD;&#xC758; &#xAC01; &#xACC4;&#xCE35;&#xC744; &#xD3B8;&#xB9AC;&#xD558;&#xAC8C; &#xC870;&#xB9BD;&#xD560; &#xC218; &#xC788;&#xB3C4;&#xB85D; &#xBCC4;&#xB3C4;&#xC758; &#xCF54;&#xB529; &#xACFC;&#xC815;&#xC774; &#xD544;&#xC694;&#xC5C6;&#xB294; GUI &#xAE30;&#xBC18;&#xC758; &#xC2E0;&#xACBD;&#xB9DD; &#xBAA8;&#xB378; &#xBE4C;&#xB354;&#xB97C; &#xC81C;&#xACF5;&#xD569;&#xB2C8;&#xB2E4;.</p>
<p><br></p>
<p><img src="manual_3-3_3_1.png" alt=""></p>
<blockquote>
<p>&#x2460; Neural Network &#xBAA8;&#xB4C8;&#xC744; &#xB4DC;&#xB798;&#xADF8;&amp;&#xB4DC;&#xB86D;&#xD558;&#xC5EC; &#xBC30;&#xCE58;&#xD569;&#xB2C8;&#xB2E4;.</p>
</blockquote>
<p><br></p>
<p><img src="manual_3-3_3_2.png" alt=""></p>
<blockquote>
<p>&#x2461; &#xBC30;&#xCE58;&#xD55C; &#xBAA8;&#xB4C8;&#xC744; &#xBAA8;&#xB4C8; &#xC544;&#xC774;&#xCF58;&#xC758; &#xAC00;&#xC6B4;&#xB370;&#xC5D0; &#xCEE4;&#xC11C;&#xB97C; &#xB450;&#xBA74; &#xC5F0;&#xACB0; &#xBAA8;&#xB4DC;&#xAC00; &#xD65C;&#xC131;&#xD654;&#xB429;&#xB2C8;&#xB2E4;(&#xD074;&#xB9BD;&#xBAA8;&#xC591; &#xD45C;&#xC2DC;).<br>&#xD074;&#xB9BD; &#xC544;&#xC774;&#xCF58;&#xC744; &#xD074;&#xB9AD;&#xD55C; &#xC0C1;&#xD0DC;&#xC5D0;&#xC11C; &#xB4DC;&#xB798;&#xADF8;&#xD558;&#xACE0; &#xB2E4;&#xC74C; &#xBAA8;&#xB4C8;&#xB85C; &#xC5F0;&#xACB0;&#xD558;&#xBA74; &#xC704; &#xC0AC;&#xC9C4;&#xACFC; &#xAC19;&#xC774; &#xB179;&#xC0C9; &#xC120;&#xC774; &#xC5F0;&#xACB0;&#xB418;&#xACE0;, &#xD074;&#xB9AD; &#xD574;&#xC81C;&#xB97C; &#xD558;&#xBA74; &#xBAA8;&#xB4C8;&#xB4E4;&#xC774; &#xD654;&#xC0B4;&#xD45C;&#xB85C; &#xC5F0;&#xACB0;&#xB429;&#xB2C8;&#xB2E4;.</p>
</blockquote>
<p><br></p>
<p><img src="manual_3-3_3_3.png" alt=""></p>
<blockquote>
<p>&#x2462; &#xAC01; Neural Network &#xBAA8;&#xB4C8;&#xB4E4;&#xB3C4; Image Processing &#xBAA8;&#xB4C8;&#xB4E4;&#xCC98;&#xB7FC; &#xBAA8;&#xB4C8;&#xC758; &#xAE30;&#xB2A5;&#xACFC; &#xC0C1;&#xC138; &#xC124;&#xBA85;, &#xD65C;&#xC6A9; &#xC608;&#xC2DC;&#xAC00; &#xC6B0;&#xCE21; Information &#xD0ED;&#xC5D0; &#xC785;&#xB825;&#xB418;&#xC5B4; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.<br>&#xD574;&#xB2F9; Information&#xC744; &#xC77D;&#xC5B4;&#xBCF4;&#xACE0; &#xC0C1;&#xD669;&#xC5D0; &#xB9DE;&#xB294; &#xBAA8;&#xB4C8;&#xC744; &#xC0AC;&#xC6A9;&#xD558;&#xBA74; &#xB429;&#xB2C8;&#xB2E4;.</p>
</blockquote>
<p><br></p>
<p><img src="manual_3-3_3_4.png" alt=""></p>
<blockquote>
<p>&#x2463; Information &#xD0ED; &#xC544;&#xB798;&#xC5D0; &#xC788;&#xB294; Parameter &#xD0ED;&#xC5D0;&#xC11C; &#xBAA8;&#xB4C8;&#xC758; &#xC124;&#xC815;&#xAC12;&#xC744; &#xBCC0;&#xACBD;&#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
</blockquote>
<p><br><br></p>
<h3 id="4-project-run-&#xC2E4;&#xD589;&#xD558;&#xAE30;">4) Project Run &#xC2E4;&#xD589;&#xD558;&#xAE30;</h3>
<p>&#xC774;&#xC81C; &#xD504;&#xB85C;&#xC81D;&#xD2B8; &#xD30C;&#xC774;&#xD504;&#xB77C;&#xC778;&#xC774; &#xC804;&#xBD80; &#xC5F0;&#xACB0;&#xB418;&#xC5C8;&#xC73C;&#xBBC0;&#xB85C; &#xD30C;&#xC774;&#xD504;&#xB77C;&#xC778;&#xC744; &#xC2E4;&#xD589;&#xC2DC;&#xCF1C; &#xD559;&#xC2B5;&#xC744; &#xC218;&#xD589;&#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.<br>&#xD504;&#xB85C;&#xC81D;&#xD2B8; &#xD30C;&#xC774;&#xD504;&#xB77C;&#xC778;&#xC744; &#xC2E4;&#xD589;&#xD558;&#xB294; &#xBC29;&#xBC95;&#xC740; &#xB450; &#xAC00;&#xC9C0;&#xAC00; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. &#xC804;&#xCCB4; &#xD30C;&#xC774;&#xD504;&#xB77C;&#xC778;&#xC744; &#xD55C; &#xBC88;&#xC5D0; &#xC2E4;&#xD589;&#xC2DC;&#xD0A4;&#xAC70;&#xB098;, &#xAC1C;&#xBCC4; &#xBAA8;&#xB4C8; &#xB2E8;&#xC704;&#xB85C; &#xC2E4;&#xD589;&#xC2DC;&#xD0AC; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<h4 id="i-&#xC804;&#xCCB4;-&#xC2E4;&#xD589;">I. &#xC804;&#xCCB4; &#xC2E4;&#xD589;</h4>
<p><img src="manual_3-3_4_1_1.png" alt=""></p>
<p>&#xD504;&#xB85C;&#xC81D;&#xD2B8; &#xC804;&#xCCB4; &#xC2E4;&#xD589;&#xC740; &#xC0C1;&#xB2E8; &#xC6B0;&#xCE21;&#xC758; <strong>RUN</strong> &#xBC84;&#xD2BC;&#xC744; &#xB20C;&#xB7EC; &#xD55C; &#xBC88;&#xC5D0; &#xD30C;&#xC774;&#xD504;&#xB77C;&#xC778;&#xC758; &#xC88C;&#xCE21;&#xBD80;&#xD130; &#xC6B0;&#xCE21;&#xAE4C;&#xC9C0; &#xC21C;&#xCC28;&#xC801;&#xC73C;&#xB85C; &#xBAA8;&#xB4C8;&#xC744; &#xC2E4;&#xD589;&#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.<br>&#xAC01; &#xC2E4;&#xD589;&#xB2E8;&#xACC4;&#xC5D0;&#xC120; &#xC2E4;&#xD589; &#xB85C;&#xADF8;&#xC640; Output &#xD30C;&#xC77C;&#xC744; &#xC774;&#xBBF8;&#xC9C0; &#xBDF0;&#xC5B4;&#xB97C; &#xD1B5;&#xD574; &#xD655;&#xC778; &#xAC00;&#xB2A5;&#xD569;&#xB2C8;&#xB2E4;.</p>
<p><strong>RUN</strong> &#xBC84;&#xD2BC;&#xC758; &#xC6B0;&#xCE21; &#xC810;&#xC120; &#xBC84;&#xD2BC;&#xC740; &#xC138;&#xBD80;&#xC801;&#xC73C;&#xB85C; &#xD504;&#xB85C;&#xC81D;&#xD2B8; &#xC804;&#xCCB4; &#xC2E4;&#xD589;&#xC744; &#xC218;&#xD589;&#xD560; &#xC218; &#xC788;&#xB294; &#xAE30;&#xB2A5; &#xB4E4;&#xC744; &#xC9C0;&#xC6D0;&#xD558;&#xACE0; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.<br>&#xD574;&#xB2F9; &#xBC84;&#xD2BC;&#xC744; &#xD074;&#xB9AD;&#xD558;&#xBA74; &#xC544;&#xB798;&#xC640; &#xAC19;&#xC774; 3&#xAC00;&#xC9C0;&#xC758; &#xC2E4;&#xD589; &#xC544;&#xC774;&#xCF58;&#xC774; &#xD31D;&#xC5C5; &#xB429;&#xB2C8;&#xB2E4;.</p>
<p><img src="manual_3-3_4_1_2.png" alt=""></p>
<blockquote>
<ul>
<li><p><strong>RUN(All modules)</strong> &#xBC84;&#xD2BC;&#xC740; &#xAE30;&#xC874;&#xC758;  RUN &#xBC84;&#xD2BC;&#xACFC; &#xB3D9;&#xC77C;&#xD55C; &#xAE30;&#xB2A5;&#xC744; &#xC218;&#xD589;&#xD569;&#xB2C8;&#xB2E4;.   &#xD30C;&#xC774;&#xD504;&#xB77C;&#xC778;&#xC758; &#xAC00;&#xC7A5; &#xC88C;&#xCE21; &#xBAA8;&#xB4C8;&#xBD80;&#xD130; &#xC21C;&#xCC28;&#xC801;&#xC73C;&#xB85C; &#xC5F0;&#xACB0;&#xB41C; &#xBAA8;&#xB4C8;&#xC744; &#xC804;&#xCCB4;&#xC801;&#xC73C;&#xB85C; &#xC2E4;&#xD589;&#xD569;&#xB2C8;&#xB2E4;.</p>
</li>
<li><p><strong>RUN (From first incomplete module)</strong> &#xBC84;&#xD2BC;&#xC740; &#xC2E4;&#xD589;&#xB418;&#xC9C0; &#xC54A;&#xC740; &#xBAA8;&#xB4C8; &#xC911; &#xAC00;&#xC7A5; &#xC88C;&#xCE21;&#xC758; &#xBAA8;&#xB4C8;&#xB85C;&#xBD80;&#xD130; &#xC21C;&#xCC28;&#xC801;&#xC73C;&#xB85C; &#xC5F0;&#xACB0;&#xB41C; &#xBAA8;&#xB4C8;&#xC744; &#xC2E4;&#xD589;&#xD569;&#xB2C8;&#xB2E4;.</p>
</li>
<li><p><strong>Sample RUN</strong> &#xBC84;&#xD2BC;&#xC740; &#xC804;&#xCCB4; &#xB370;&#xC774;&#xD130;&#xC14B;&#xC744; &#xD65C;&#xC6A9;&#xD574;&#xC11C; &#xC2E4;&#xD589;&#xD558;&#xB294; &#xAC83;&#xC774; &#xC544;&#xB2CC; &#xB370;&#xC774;&#xD130;&#xC14B;&#xC758; &#xC77C;&#xBD80; &#xB9CC;&#xC744; &#xC0AC;&#xC6A9;&#xD574;&#xC11C; &#xD504;&#xB85C;&#xC81D;&#xD2B8; &#xD30C;&#xC774;&#xD504;&#xB77C;&#xC778;&#xC744; &#xC2E4;&#xD589;&#xD569;&#xB2C8;&#xB2E4;.   &#xB370;&#xC774;&#xD130;&#xC14B;&#xC774; &#xB9E4;&#xC6B0; &#xCEE4;&#xC11C; &#xAC01; &#xBAA8;&#xB4C8;&#xC758; &#xCC98;&#xB9AC; &#xC2DC;&#xAC04;&#xC774; &#xB9E4;&#xC6B0; &#xAE34; &#xACBD;&#xC6B0; &#xD55C;&#xBC88; &#xBAA8;&#xB4C8;&#xC744; &#xC798;&#xBABB; &#xC0AC;&#xC6A9;&#xD558;&#xBA74; &#xCC98;&#xC74C;&#xBD80;&#xD130; &#xB2E4;&#xC2DC; &#xC624;&#xB79C; &#xC2DC;&#xAC04;&#xC5D0; &#xAC78;&#xCCD0; &#xBAA8;&#xB4C8; &#xB4E4;&#xC744; &#xC2E4;&#xD589;&#xD574;&#xC57C; &#xD569;&#xB2C8;&#xB2E4;.   &#xC774;&#xB7EC;&#xD55C; &#xAC83;&#xC744; &#xBC29;&#xC9C0;&#xD558;&#xAE30; &#xC704;&#xD574; &#xB370;&#xC774;&#xD130;&#xC14B;&#xC758; &#xC77C;&#xBD80;&#xB97C; &#xCD94;&#xCD9C;&#xD574;&#xC11C;  Sample RUN&#xC73C;&#xB85C; &#xBA3C;&#xC800; &#xC804;&#xCCB4; &#xD30C;&#xC774;&#xD504;&#xB77C;&#xC778;&#xC744; &#xC2E4;&#xD589;&#xD558;&#xC5EC; &#xB370;&#xC774;&#xD130;&#xC758; &#xBCC0;&#xD654;&#xB97C; &#xC0B4;&#xD3B4;&#xBCF4;&#xACE0; &#xC218;&#xC815; &#xACFC;&#xC815;&#xC744; &#xAC70;&#xCE5C; &#xB4A4; &#xCD5C;&#xC885;&#xC801;&#xC73C;&#xB85C; &#xD504;&#xB85C;&#xC81D;&#xD2B8;&#xB97C; &#xC2E4;&#xD589;&#xC744; &#xD558;&#xB294; &#xAC83;&#xC774; &#xD6A8;&#xC728;&#xC801;&#xC73C;&#xB85C; &#xC5F0;&#xAD6C; &#xD504;&#xB85C;&#xC81D;&#xD2B8;&#xB97C; &#xC218;&#xD589;&#xD560; &#xC218; &#xC788;&#xB294; &#xBC29;&#xBC95;&#xC785;&#xB2C8;&#xB2E4;.</p>
</li>
</ul>
</blockquote>
<p><br></p>
<h4 id="ii-&#xBAA8;&#xB4C8;-&#xC2E4;&#xD589;">II. &#xBAA8;&#xB4C8; &#xC2E4;&#xD589;</h4>
<p><img src="manual_3-3_4_2.png" alt=""></p>
<p>&#xBAA8;&#xB4C8;&#xC758; &#xC2E4;&#xD589;&#xC740; &#xB450; &#xAC00;&#xC9C0; &#xBC29;&#xBC95;&#xC774; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.  </p>
<ul>
<li>&#xC88C;&#xCE21;&#xC758; <strong>Play</strong> &#xBC84;&#xD2BC;&#xC744; &#xD074;&#xB9AD;&#xD558;&#xBA74; &#xD574;&#xB2F9; &#xBAA8;&#xB4C8; &#xD558;&#xB098;&#xB9CC; &#xC2E4;&#xD589;&#xC774; &#xB429;&#xB2C8;&#xB2E4;.  </li>
<li>&#xC6B0;&#xCE21;&#xC758; <strong>Step forward</strong> &#xBC84;&#xD2BC;&#xC744; &#xD074;&#xB9AD;&#xD558;&#xBA74; &#xD574;&#xB2F9; &#xBAA8;&#xB4C8;&#xACFC; &#xD574;&#xB2F9; &#xBAA8;&#xB4C8;&#xC758; &#xB4A4;(&#xC6B0;&#xCE21;)&#xB85C; &#xC5F0;&#xACB0;&#xB418;&#xC5B4; &#xC788;&#xB294; &#xBAA8;&#xB4E0; &#xBAA8;&#xB4C8;&#xB4E4;&#xC774; &#xC21C;&#xCC28;&#xC801;&#xC73C;&#xB85C; &#xC2E4;&#xD589;&#xB429;&#xB2C8;&#xB2E4;.</li>
</ul>

                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="데이터셋_업로드_및_관리하기.html" class="navigation navigation-prev " aria-label="Previous page: 3-2. 데이터셋 업로드 및 관리하기">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
                <a href="성능_평가.html" class="navigation navigation-next " aria-label="Next page: 3-4. 성능 평가">
                    <i class="fa fa-angle-right"></i>
                </a>
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"3-3. 파이프라인 생성","level":"1.4.3","depth":2,"next":{"title":"3-4. 성능 평가","level":"1.4.4","depth":2,"path":"chapter3/성능_평가.md","ref":"chapter3/성능_평가.md","articles":[]},"previous":{"title":"3-2. 데이터셋 업로드 및 관리하기","level":"1.4.2","depth":2,"path":"chapter3/데이터셋_업로드_및_관리하기.md","ref":"chapter3/데이터셋_업로드_및_관리하기.md","articles":[]},"dir":"ltr"},"config":{"gitbook":"*","theme":"default","variables":{},"plugins":[],"pluginsConfig":{"highlight":{},"search":{},"lunr":{"maxIndexSize":1000000,"ignoreSpecialCharacters":false},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"fontsettings":{"theme":"white","family":"sans","size":2},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"}},"file":{"path":"chapter3/파이프라인_생성.md","mtime":"2020-11-24T05:39:43.797Z","type":"markdown"},"gitbook":{"version":"3.2.3","time":"2020-11-24T05:44:23.533Z"},"basePath":"..","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="../gitbook/gitbook.js"></script>
    <script src="../gitbook/theme.js"></script>
    
        
        <script src="../gitbook/gitbook-plugin-search/search-engine.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-search/search.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-lunr/lunr.min.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-lunr/search-lunr.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-sharing/buttons.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

